[[clearing-windows-event-logs]]
=== Clearing Windows Event Logs

Identifies attempts to clear or disable Windows event log stores using Windows wevetutil command. This is often done by attackers in an attempt to evade detection or destroy forensic evidence on a system.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: low

*Risk score*: 21

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Defense Evasion

*Version*: 11 (<<clearing-windows-event-logs-history, version history>>)

*Added ({stack} release)*: 7.6.0

*Last modified ({stack} release)*: 7.16.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Rule query


[source,js]
----------------------------------
process where event.type in ("process_started", "start") and
(process.name : "wevtutil.exe" or process.pe.original_file_name ==
"wevtutil.exe") and process.args : ("/e:false", "cl", "clear-log")
or process.name : ("powershell.exe", "pwsh.exe",
"powershell_ise.exe") and process.args : "Clear-EventLog"
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Defense Evasion
** ID: TA0005
** Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
** Name: Indicator Removal on Host
** ID: T1070
** Reference URL: https://attack.mitre.org/techniques/T1070/

[[clearing-windows-event-logs-history]]
==== Rule version history

Version 11 (7.16.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("process_started", "start") and
(process.name : "wevtutil.exe" or process.pe.original_file_name ==
"wevtutil.exe") and process.args : ("/e:false", "cl", "clear-log")
or process.name : "powershell.exe" and process.args : "Clear-
EventLog"
----------------------------------

Version 9 (7.13.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:process and event.type:(process_started or start) and
(process.name:"wevtutil.exe" or
process.pe.original_file_name:"wevtutil.exe") and
process.args:("/e:false" or cl or "clear-log") or
process.name:"powershell.exe" and process.args:"Clear-EventLog"
----------------------------------

Version 8 (7.12.0 release)::
* Formatting only

Version 7 (7.11.2 release)::
* Formatting only

Version 6 (7.11.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:process and event.type:(start or process_started) and
process.name:wevtutil.exe and process.args:cl or
process.name:powershell.exe and process.args:Clear-EventLog
----------------------------------

Version 5 (7.10.0 release)::
* Formatting only

Version 4 (7.9.1 release)::
* Formatting only

Version 3 (7.9.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.action:"Process Create (rule: ProcessCreate)" and
process.name:wevtutil.exe and process.args:cl or
process.name:powershell.exe and process.args:Clear-EventLog
----------------------------------

Version 2 (7.7.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.action:"Process Create (rule: ProcessCreate)" and
(process.name:"wevtutil.exe" and process.args:"cl") or
(process.name:"powershell.exe" and process.args:"Clear-EventLog")
----------------------------------

