[[direct-outbound-smb-connection]]
=== Direct Outbound SMB Connection

Identifies unexpected processes making network connections over port 445. Windows File Sharing is typically implemented over Server Message Block (SMB), which communicates between hosts using port 445. When legitimate, these network connections are established by the kernel. Processes making 445/tcp connections may be port scanners, exploits, or suspicious user-level processes moving laterally.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Lateral Movement

*Version*: 100 (<<direct-outbound-smb-connection-history, version history>>)

*Added ({stack} release)*: 7.6.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------
## Triage and analysis

### Investigating Direct Outbound SMB Connection

This rule looks for unexpected processes making network connections over port 445. Windows file sharing is typically
implemented over Server Message Block (SMB), which communicates between hosts using port 445. When legitimate, these
network connections are established by the kernel (PID 4). Occurrences of non-system processes using this port can indicate
port scanners, exploits, and tools used to move laterally on the environment.

#### Possible investigation steps

- Investigate the process execution chain (parent process tree) for unknown processes. Examine their executable files
for prevalence, whether they are located in expected locations, and if they are signed with valid digital signatures.
- Investigate other alerts associated with the user/host during the past 48 hours.
- Contact the account owner and confirm whether they are aware of this activity.
- Investigate abnormal behaviors observed by the subject process such as network connections, registry or file
modifications, and any spawned child processes.
- Retrieve the process executable and determine if it is malicious:
  - Use a private sandboxed malware analysis system to perform analysis.
    - Observe and collect information about the following activities:
      - Attempts to contact external domains and addresses.
      - File and registry access, modification, and creation activities.
      - Service creation and launch activities.
      - Scheduled tasks creation.
  - Use the PowerShell Get-FileHash cmdlet to get the files' SHA-256 hash values.
    - Search for the existence and reputation of the hashes in resources like VirusTotal, Hybrid-Analysis, CISCO Talos, Any.run, etc.

### False positive analysis

- If this rule is noisy in your environment due to expected activity, consider adding exceptions — preferably with a combination
of user and command line conditions.

### Response and remediation

- Initiate the incident response process based on the outcome of the triage.
- Isolate the involved host to prevent further post-compromise behavior.
- If the triage identified malware, search the environment for additional compromised hosts.
  - Implement temporary network rules, procedures, and segmentation to contain the malware.
  - Stop suspicious processes.
  - Immediately block the identified indicators of compromise (IoCs).
  - Inspect the affected systems for additional malware backdoors like reverse shells, reverse proxies, or droppers that
  attackers could use to reinfect the system.
- Remove and block malicious artifacts identified during triage.
- Run a full antimalware scan. This may reveal additional artifacts left in the system, persistence mechanisms, and
malware components.
- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.
- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the
mean time to respond (MTTR).

----------------------------------


==== Rule query


[source,js]
----------------------------------
sequence by process.entity_id [process where event.type == "start"
and host.os.name == "Windows" and process.pid != 4 and not
(process.executable :
"D:\\EnterpriseCare\\tools\\jre.1\\bin\\java.exe" and process.args :
"com.emeraldcube.prism.launcher.Invoker") and not
(process.executable : "C:\\Docusnap 11\\Tools\\nmap\\nmap.exe" and
process.args : "smb-os-discovery.nse") and not process.executable :
("?:\\Program Files\\SentinelOne\\Sentinel Agent
*\\Ranger\\SentinelRanger.exe", "?:\\Program
Files\\Ivanti\\Security Controls\\ST.EngineHost.exe",
"?:\\Program Files (x86)\\Fortinet\\FSAE\\collectoragent.exe",
"?:\\Program Files (x86)\\Nmap\\nmap.exe", "?:\\Program
Files\\Azure Advanced Threat Protection
Sensor\\*\\Microsoft.Tri.Sensor.exe", "?:\\Program
Files\\CloudMatters\\auvik\\AuvikService-release-*\\AuvikService.exe",
"?:\\Program Files\\uptime software\\uptime\\UptimeDataCollector.exe",
"?:\\Program Files\\CloudMatters\\auvik\\AuvikAgentService.exe",
"?:\\Program Files\\Rumble\\rumble-agent-*.exe")] [network where
destination.port == 445 and process.pid != 4 and not
cidrmatch(destination.ip, "127.0.0.1", "::1")]
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Lateral Movement
** ID: TA0008
** Reference URL: https://attack.mitre.org/tactics/TA0008/
* Technique:
** Name: Remote Services
** ID: T1021
** Reference URL: https://attack.mitre.org/techniques/T1021/

[[direct-outbound-smb-connection-history]]
==== Rule version history

Version 100 (8.5.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
sequence by process.entity_id [process where event.type == "start"
and process.pid != 4] [network where destination.port == 445 and
process.pid != 4 and not cidrmatch(destination.ip, "127.0.0.1",
"::1")]
----------------------------------

Version 9 (8.4.0 release)::
* Formatting only

Version 7 (7.16.0 release)::
* Formatting only

Version 6 (7.12.0 release)::
* Formatting only

Version 5 (7.10.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:network and event.type:connection and
destination.port:445 and not process.pid:4 and not
destination.ip:(127.0.0.1 or "::1")
----------------------------------

Version 4 (7.9.1 release)::
* Formatting only

Version 3 (7.9.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.action:"Network connection detected (rule: NetworkConnect)" and
destination.port:445 and not process.pid:4 and not
destination.ip:(127.0.0.1 or "::1")
----------------------------------

Version 2 (7.7.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.action:"Network connection detected (rule: NetworkConnect)" and
destination.port:445 and not process.pid:4 and not
destination.ip:("127.0.0.1" or "::1")
----------------------------------

