[[enable-host-network-discovery-via-netsh]]
=== Enable Host Network Discovery via Netsh

Identifies use of the netsh.exe program to enable host discovery via the network. Attackers can use this command-line tool to weaken the host firewall settings.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Defense Evasion

*Version*: 1

*Added ({stack} release)*: 7.14.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Potential false positives

Host Windows Firewall planned system administration changes.

==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.name : "netsh.exe" and
process.args : ("firewall", "advfirewall") and process.args :
"group=Network Discovery" and process.args : "enable=Yes"
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Defense Evasion
** ID: TA0005
** Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
** Name: Impair Defenses
** ID: T1562
** Reference URL: https://attack.mitre.org/techniques/T1562/
