[[enumeration-command-spawned-via-wmiprvse]]
=== Enumeration Command Spawned via WMIPrvSE

Identifies native Windows host and network enumeration commands spawned by the Windows Management Instrumentation Provider Service (WMIPrvSE).

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*
* endgame-*

*Severity*: low

*Risk score*: 21

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Execution
* Elastic Endgame

*Version*: 102 (<<enumeration-command-spawned-via-wmiprvse-history, version history>>)

*Added ({stack} release)*: 7.12.0

*Last modified ({stack} release)*: 8.6.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.name: (
"arp.exe", "dsquery.exe", "dsget.exe", "gpresult.exe",
"hostname.exe", "ipconfig.exe", "nbtstat.exe", "net.exe",
"net1.exe", "netsh.exe", "netstat.exe", "nltest.exe",
"ping.exe", "qprocess.exe", "quser.exe", "qwinsta.exe",
"reg.exe", "sc.exe", "systeminfo.exe", "tasklist.exe",
"tracert.exe", "whoami.exe" ) and
process.parent.name:"wmiprvse.exe"
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Execution
** ID: TA0002
** Reference URL: https://attack.mitre.org/tactics/TA0002/
* Technique:
** Name: Windows Management Instrumentation
** ID: T1047
** Reference URL: https://attack.mitre.org/techniques/T1047/


* Tactic:
** Name: Discovery
** ID: TA0007
** Reference URL: https://attack.mitre.org/tactics/TA0007/
* Technique:
** Name: Remote System Discovery
** ID: T1018
** Reference URL: https://attack.mitre.org/techniques/T1018/

[[enumeration-command-spawned-via-wmiprvse-history]]
==== Rule version history

Version 102 (8.6.0 release)::
* Formatting only

Version 101 (8.5.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
process.name: ( "arp.exe", "dsquery.exe", "dsget.exe",
"gpresult.exe", "hostname.exe", "ipconfig.exe",
"nbtstat.exe", "net.exe", "net1.exe", "netsh.exe",
"netstat.exe", "nltest.exe", "ping.exe", "qprocess.exe",
"quser.exe", "qwinsta.exe", "reg.exe", "sc.exe",
"systeminfo.exe", "tasklist.exe", "tracert.exe",
"whoami.exe" ) and process.parent.name:"wmiprvse.exe"
----------------------------------

Version 5 (8.4.0 release)::
* Formatting only

Version 3 (8.2.0 release)::
* Formatting only

Version 2 (7.16.0 release)::
* Formatting only

