[[execution-of-com-object-via-xwizard]]
=== Execution of COM object via Xwizard

Windows Component Object Model (COM) is an inter-process communication (IPC) component of the native Windows application programming interface (API) that enables interaction between software objects or executable code. Xwizard can be used to run a COM object created in registry to evade defensive counter measures.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*
* endgame-*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
* http://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Execution
* Elastic Endgame

*Version*: 102 (<<execution-of-com-object-via-xwizard-history, version history>>)

*Added ({stack} release)*: 7.12.0

*Last modified ({stack} release)*: 8.6.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.pe.original_file_name
: "xwizard.exe" and ( (process.args : "RunWizard" and process.args
: "{*}") or (process.executable != null and not
process.executable : ("C:\\Windows\\SysWOW64\\xwizard.exe",
"C:\\Windows\\System32\\xwizard.exe") ) )
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Execution
** ID: TA0002
** Reference URL: https://attack.mitre.org/tactics/TA0002/
* Technique:
** Name: Inter-Process Communication
** ID: T1559
** Reference URL: https://attack.mitre.org/techniques/T1559/

[[execution-of-com-object-via-xwizard-history]]
==== Rule version history

Version 102 (8.6.0 release)::
* Formatting only

Version 101 (8.5.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
process.pe.original_file_name : "xwizard.exe" and ( (process.args
: "RunWizard" and process.args : "{*}") or (process.executable !=
null and not process.executable :
("C:\\Windows\\SysWOW64\\xwizard.exe",
"C:\\Windows\\System32\\xwizard.exe") ) )
----------------------------------

Version 4 (8.4.0 release)::
* Formatting only

Version 2 (8.2.0 release)::
* Formatting only

