[[execution-of-file-written-or-modified-by-pdf-reader]]
=== Execution of File Written or Modified by PDF Reader

Identifies a suspicious file that was written by a PDF reader application and subsequently executed. These processes are often launched via exploitation of PDF applications.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* winlogbeat-*

*Severity*: high

*Risk score*: 21

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Windows

*Version*: 1

*Added ({stack} release)*: 7.10.0

*Rule authors*: Elastic

*Rule license*: Elastic License

==== Rule query


[source,js]
----------------------------------
sequence with maxspan=2h [file where event.type != "delete" and
file.extension == "exe" and process.name in ("acrord32.exe",
"rdrcef.exe", "foxitphantomPDF.exe", "foxitreader.exe") and
file.name not in ("foxitphantomPDF.exe",
"FoxitPhantomPDFUpdater.exe",
"foxitreader.exe", "FoxitReaderUpdater.exe",
"acrord32.exe", "rdrcef.exe") ] by host.id,
file.path [process where event.type in ("start", "process_started")]
by host.id, process.executable
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Execution
** ID: TA0002
** Reference URL: https://attack.mitre.org/tactics/TA0002/
* Technique:
** Name: Scripting
** ID: T1064
** Reference URL: https://attack.mitre.org/techniques/T1064/
