[[execution-of-file-written-or-modified-by-pdf-reader]]
=== Execution of File Written or Modified by PDF Reader

Identifies a suspicious file that was written by a PDF reader application and subsequently executed. These processes are often launched via exploitation of PDF applications.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* winlogbeat-*
* logs-windows.*

*Severity*: high

*Risk score*: 21

*Runs every*: 60 minutes

*Searches indices from*: now-120m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Execution

*Version*: 4 (<<execution-of-file-written-or-modified-by-pdf-reader-history, version history>>)

*Added ({stack} release)*: 7.10.0

*Last modified ({stack} release)*: 7.14.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Rule query


[source,js]
----------------------------------
sequence with maxspan=2h [file where event.type != "deletion" and
file.extension : "exe" and (process.name : "AcroRd32.exe" or
process.name : "rdrcef.exe" or process.name :
"FoxitPhantomPDF.exe" or process.name : "FoxitReader.exe") and
not (file.name : "FoxitPhantomPDF.exe" or file.name :
"FoxitPhantomPDFUpdater.exe" or file.name :
"FoxitReader.exe" or file.name : "FoxitReaderUpdater.exe" or
file.name : "AcroRd32.exe" or file.name : "rdrcef.exe") ]
by host.id, file.path [process where event.type in ("start",
"process_started")] by host.id, process.executable
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Execution
** ID: TA0002
** Reference URL: https://attack.mitre.org/tactics/TA0002/


* Tactic:
** Name: Initial Access
** ID: TA0001
** Reference URL: https://attack.mitre.org/tactics/TA0001/
* Technique:
** Name: Phishing
** ID: T1566
** Reference URL: https://attack.mitre.org/techniques/T1566/

[[execution-of-file-written-or-modified-by-pdf-reader-history]]
==== Rule version history

Version 4 (7.14.0 release)::
* Formatting only

Version 3 (7.12.0 release)::
* Formatting only

Version 2 (7.11.0 release)::
* Formatting only

