[[execution-of-an-unsigned-service]]
=== Execution of an Unsigned Service

This rule identifies the execution of unsigned executables via service control manager (SCM). Adversaries may abuse SCM to execute malware or escalate privileges.

*Rule type*: eql

*Rule indices*: 

* logs-endpoint.events.*

*Severity*: low

*Risk score*: 21

*Runs every*: 60m

*Searches indices from*: now-119m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*: None

*Tags*: 

* Domain: Endpoint
* OS: Windows
* Use Case: Threat Detection
* Tactic: Execution
* Rule Type: BBR

*Version*: 1

*Rule authors*: 

* Elastic

*Rule license*: Elastic License v2


==== Rule query


[source, js]
----------------------------------
process where host.os.type == "windows" and event.type == "start" and
( 
  (
    process.parent.executable : "C:\\Windows\\System32\\services.exe" and
    (process.code_signature.exists == false or process.code_signature.trusted == false)
  )
)

----------------------------------

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Execution
** ID: TA0002
** Reference URL: https://attack.mitre.org/tactics/TA0002/
* Technique:
** Name: System Services
** ID: T1569
** Reference URL: https://attack.mitre.org/techniques/T1569/
* Sub-technique:
** Name: Service Execution
** ID: T1569.002
** Reference URL: https://attack.mitre.org/techniques/T1569/002/
