[[file-and-directory-discovery]]
=== File and Directory Discovery

Enumeration of files and directories using built-in tools. Adversaries may use the information discovered to plan follow-on activity.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* winlogbeat-*
* logs-windows.*

*Severity*: low

*Risk score*: 21

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Discovery

*Version*: 3 (<<file-and-directory-discovery-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 7.12.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Potential false positives

Enumeration of files and directories may not be inherently malicious and noise may come from scripts, automation tools, or normal command line usage. It's important to baseline your environment to determine the amount of expected noise and exclude any known FP's from the rule.

==== Rule query


[source,js]
----------------------------------
sequence by agent.id, user.name with maxspan=1m [process where
event.type in ("start", "process_started") and ((process.name :
"cmd.exe" or process.pe.original_file_name == "Cmd.Exe") and
process.args : "dir") or process.name : "tree.com"] [process where
event.type in ("start", "process_started") and ((process.name :
"cmd.exe" or process.pe.original_file_name == "Cmd.Exe") and
process.args : "dir") or process.name : "tree.com"] [process where
event.type in ("start", "process_started") and ((process.name :
"cmd.exe" or process.pe.original_file_name == "Cmd.Exe") and
process.args : "dir") or process.name : "tree.com"]
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Discovery
** ID: TA0007
** Reference URL: https://attack.mitre.org/tactics/TA0007/
* Technique:
** Name: File and Directory Discovery
** ID: T1083
** Reference URL: https://attack.mitre.org/techniques/T1083/

[[file-and-directory-discovery-history]]
==== Rule version history

Version 3 (7.12.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
(process.name : "cmd.exe" or process.pe.original_file_name ==
"Cmd.Exe") and process.args : ("dir", "tree")
----------------------------------

Version 2 (7.11.2 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
(process.name : "cmd.exe" or process.pe.original_file_name ==
"Cmd.Exe") and process.args : ("dir", "tree")
----------------------------------

