[[iis-http-logging-disabled]]
=== IIS HTTP Logging Disabled

Identifies when Internet Information Services (IIS) HTTP Logging is disabled on a server. An attacker with IIS server access via a webshell or other mechanism can disable HTTP Logging as an effective anti-forensics measure.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: high

*Risk score*: 73

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 33

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Defense Evasion

*Version*: 101 (<<iis-http-logging-disabled-history, version history>>)

*Added ({stack} release)*: 7.10.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and (process.name : "appcmd.exe"
or process.pe.original_file_name == "appcmd.exe") and process.args :
"/dontLog*:*True" and not process.parent.name : "iissetup.exe"
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Defense Evasion
** ID: TA0005
** Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
** Name: Impair Defenses
** ID: T1562
** Reference URL: https://attack.mitre.org/techniques/T1562/

[[iis-http-logging-disabled-history]]
==== Rule version history

Version 101 (8.5.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
(process.name : "appcmd.exe" or process.pe.original_file_name ==
"appcmd.exe") and process.args : "/dontLog*:*True" and not
process.parent.name : "iissetup.exe"
----------------------------------

Version 9 (8.4.0 release)::
* Formatting only

Version 7 (8.2.0 release)::
* Formatting only

Version 6 (7.16.0 release)::
* Formatting only

Version 5 (7.13.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:process and event.type:(start or process_started) and
(process.name:appcmd.exe or process.pe.original_file_name:appcmd.exe)
and process.args:/dontLog\:\"True\" and not
process.parent.name:iissetup.exe
----------------------------------

Version 4 (7.12.0 release)::
* Formatting only

Version 3 (7.11.2 release)::
* Formatting only

Version 2 (7.11.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:process and event.type:(start or process_started) and
(process.name:appcmd.exe or process.pe.original_file_name:appcmd.exe
or winlog.event_data.OriginalFileName:appcmd.exe) and
process.args:/dontLog\:\"True\" and not
process.parent.name:iissetup.exe
----------------------------------

