[[imageload-via-windows-update-auto-update-client]]
=== ImageLoad via Windows Update Auto Update Client

Identifies abuse of the Windows Update Auto Update Client (wuauclt.exe) to load an arbitrary DLL. This behavior is used as a defense evasion technique to blend-in malicious activity with legitimate Windows software.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* winlogbeat-*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://dtm.uk/wuauclt/

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Defense Evasion

*Version*: 101 (<<imageload-via-windows-update-auto-update-client-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and
(process.pe.original_file_name == "wuauclt.exe" or process.name :
"wuauclt.exe") and /* necessary windows update client args to load
a dll */ process.args : "/RunHandlerComServer" and process.args :
"/UpdateDeploymentProvider" and /* common paths writeable by a
standard user where the target DLL can be placed */ process.args :
("C:\\Users\\*.dll", "C:\\ProgramData\\*.dll",
"C:\\Windows\\Temp\\*.dll", "C:\\Windows\\Tasks\\*.dll")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Defense Evasion
** ID: TA0005
** Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
** Name: System Binary Proxy Execution
** ID: T1218
** Reference URL: https://attack.mitre.org/techniques/T1218/

[[imageload-via-windows-update-auto-update-client-history]]
==== Rule version history

Version 101 (8.5.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
(process.pe.original_file_name == "wuauclt.exe" or process.name :
"wuauclt.exe") and /* necessary windows update client args to load
a dll */ process.args : "/RunHandlerComServer" and process.args :
"/UpdateDeploymentProvider" and /* common paths writeable by a
standard user where the target DLL can be placed */ process.args :
("C:\\Users\\*.dll", "C:\\ProgramData\\*.dll",
"C:\\Windows\\Temp\\*.dll", "C:\\Windows\\Tasks\\*.dll")
----------------------------------

Version 9 (8.4.0 release)::
* Formatting only

Version 7 (8.3.0 release)::
* Formatting only

Version 5 (8.2.0 release)::
* Formatting only

Version 3 (7.12.0 release)::
* Formatting only

Version 2 (7.11.2 release)::
* Formatting only

