[[incoming-execution-via-winrm-remote-shell]]
=== Incoming Execution via WinRM Remote Shell

Identifies remote execution via Windows Remote Management (WinRM) remote shell on a target host. This could be an indication of lateral movement.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Lateral Movement

*Version*: 5 (<<incoming-execution-via-winrm-remote-shell-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Potential false positives

WinRM is a dual-use protocol that can be used for benign or malicious activity. It's important to baseline your environment to determine the amount of noise to expect from this tool.

==== Rule query


[source,js]
----------------------------------
sequence by host.id with maxspan=30s [network where process.pid ==
4 and network.direction : ("incoming", "ingress") and
destination.port in (5985, 5986) and network.protocol == "http" and
source.ip != "127.0.0.1" and source.ip != "::1" ] [process where
event.type == "start" and process.parent.name : "winrshost.exe" and
not process.name : "conhost.exe"]
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Lateral Movement
** ID: TA0008
** Reference URL: https://attack.mitre.org/tactics/TA0008/
* Technique:
** Name: Remote Services
** ID: T1021
** Reference URL: https://attack.mitre.org/techniques/T1021/

[[incoming-execution-via-winrm-remote-shell-history]]
==== Rule version history

Version 5 (8.4.0 release)::
* Formatting only

Version 4 (8.0.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
sequence by host.id with maxspan=30s [network where process.pid ==
4 and network.direction : ("incoming", "ingress") and
destination.port in (5985, 5986) and network.protocol == "http" and
not source.address in ("::1", "127.0.0.1") ] [process where
event.type == "start" and process.parent.name : "winrshost.exe" and
not process.name : "conhost.exe"]
----------------------------------

Version 3 (7.16.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
sequence by host.id with maxspan=30s [network where process.pid ==
4 and network.direction == "incoming" and destination.port in
(5985, 5986) and network.protocol == "http" and not source.address in
("::1", "127.0.0.1") ] [process where event.type == "start" and
process.parent.name : "winrshost.exe" and not process.name :
"conhost.exe"]
----------------------------------

Version 2 (7.12.0 release)::
* Formatting only

