[[lateral-movement-via-startup-folder]]
=== Lateral Movement via Startup Folder

Identifies suspicious file creations in the startup folder of a remote system. An adversary could abuse this to move laterally by dropping a malicious script or executable that will be executed after a reboot or user logon.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* winlogbeat-*
* logs-windows.*

*Severity*: high

*Risk score*: 73

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://www.mdsec.co.uk/2017/06/rdpinception/

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Lateral Movement

*Version*: 6 (<<lateral-movement-via-startup-folder-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
file where event.type in ("creation", "change") and /* via RDP
TSClient mounted share or SMB */ (process.name : "mstsc.exe" or
process.pid == 4) and file.path :
("?:\\Users\\*\\AppData\\Roaming\\Microsoft\\Windows\\Start
Menu\\Programs\\Startup\\*",
"?:\\ProgramData\\Microsoft\\Windows\\Start
Menu\\Programs\\Startup\\*")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Lateral Movement
** ID: TA0008
** Reference URL: https://attack.mitre.org/tactics/TA0008/
* Technique:
** Name: Remote Services
** ID: T1021
** Reference URL: https://attack.mitre.org/techniques/T1021/


* Tactic:
** Name: Persistence
** ID: TA0003
** Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
** Name: Boot or Logon Autostart Execution
** ID: T1547
** Reference URL: https://attack.mitre.org/techniques/T1547/

[[lateral-movement-via-startup-folder-history]]
==== Rule version history

Version 6 (8.4.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
file where event.type in ("creation", "change") and /* via RDP
TSClient mounted share or SMB */ (process.name : "mstsc.exe" or
process.pid == 4) and file.path : "C:\\*\\Microsoft\\Windows\\Start
Menu\\Programs\\Startup\\*"
----------------------------------

Version 4 (8.2.0 release)::
* Formatting only

Version 3 (7.12.0 release)::
* Formatting only

Version 2 (7.11.2 release)::
* Formatting only

