[[launchdaemon-creation-or-modification-and-immediate-loading]]
=== LaunchDaemon Creation or Modification and Immediate Loading

Indicates the creation or modification of a launch daemon, which adversaries may use to repeatedly execute malicious payloads as part of persistence.

*Rule type*: eql

*Rule indices*:

* auditbeat-*
* logs-endpoint.events.*

*Severity*: low

*Risk score*: 21

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://developer.apple.com/library/archive/documentation/MacOSX/Conceptual/BPSystemStartup/Chapters/CreatingLaunchdJobs.html

*Tags*:

* Elastic
* Host
* macOS
* Threat Detection
* Persistence

*Version*: 6 (<<launchdaemon-creation-or-modification-and-immediate-loading-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Potential false positives

Trusted applications persisting via LaunchDaemons

==== Rule query


[source,js]
----------------------------------
sequence by host.id with maxspan=1m [file where event.type !=
"deletion" and file.path : ("/System/Library/LaunchDaemons/*",
"/Library/LaunchDaemons/*")] [process where event.type in ("start",
"process_started") and process.name == "launchctl" and process.args ==
"load"]
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Persistence
** ID: TA0003
** Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
** Name: Create or Modify System Process
** ID: T1543
** Reference URL: https://attack.mitre.org/techniques/T1543/

[[launchdaemon-creation-or-modification-and-immediate-loading-history]]
==== Rule version history

Version 6 (8.4.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
sequence by host.id with maxspan=1m [file where event.type !=
"deletion" and file.path in ("/System/Library/LaunchDaemons/*",
"/Library/LaunchDaemons/*")] [process where event.type in ("start",
"process_started") and process.name == "launchctl" and process.args ==
"load"]
----------------------------------

Version 4 (8.2.0 release)::
* Formatting only

Version 3 (8.0.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
sequence by host.id with maxspan=1m [file where event.type !=
"deletion" and file.path in ("/System/Library/LaunchDaemons/*", "
/Library/LaunchDaemons/*")] [process where event.type in ("start",
"process_started") and process.name == "launchctl" and process.args ==
"load"]
----------------------------------

Version 2 (7.12.0 release)::
* Formatting only

