[[microsoft-exchange-server-um-spawning-suspicious-processes]]
=== Microsoft Exchange Server UM Spawning Suspicious Processes

Identifies suspicious processes being spawned by the Microsoft Exchange Server Unified Messaging (UM) service. This activity has been observed exploiting CVE-2021-26857.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* winlogbeat-*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://www.microsoft.com/security/blog/2021/03/02/hafnium-targeting-exchange-servers
* https://www.volexity.com/blog/2021/03/02/active-exploitation-of-microsoft-exchange-zero-day-vulnerabilities

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Initial Access

*Version*: 4 (<<microsoft-exchange-server-um-spawning-suspicious-processes-history, version history>>)

*Added ({stack} release)*: 7.12.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic, Austin Songer

*Rule license*: Elastic License v2

==== Potential false positives

Legitimate processes may be spawned from the Microsoft Exchange Server Unified Messaging (UM) service. If known processes are causing false positives, they can be exempted from the rule.

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.parent.name :
("UMService.exe", "UMWorkerProcess.exe") and not
process.executable :
("?:\\Windows\\System32\\werfault.exe",
"?:\\Windows\\System32\\wermgr.exe", "?:\\Program
Files\\Microsoft\\Exchange Server\\V??\\Bin\\UMWorkerProcess.exe",
"D:\\Exchange 2016\\Bin\\UMWorkerProcess.exe",
"E:\\ExchangeServer\\Bin\\UMWorkerProcess.exe")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Initial Access
** ID: TA0001
** Reference URL: https://attack.mitre.org/tactics/TA0001/
* Technique:
** Name: Exploit Public-Facing Application
** ID: T1190
** Reference URL: https://attack.mitre.org/techniques/T1190/

[[microsoft-exchange-server-um-spawning-suspicious-processes-history]]
==== Rule version history

Version 4 (8.4.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type == "start" and process.parent.name :
("UMService.exe", "UMWorkerProcess.exe") and not process.name :
("werfault.exe", "wermgr.exe")
----------------------------------

Version 2 (8.2.0 release)::
* Formatting only

