[[mshta-making-network-connections]]
=== Mshta Making Network Connections

Identifies Mshta.exe making outbound network connections. This may indicate adversarial activity as Mshta is often leveraged by adversaries to execute malicious scripts and evade detection.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* winlogbeat-*

*Severity*: medium

*Risk score*: 21

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Windows

*Version*: 1

*Added ({stack} release)*: 7.10.0

*Rule authors*: Elastic

*Rule license*: Elastic License

==== Rule query


[source,js]
----------------------------------
sequence by process.entity_id with maxspan=2h [process where
event.type in ("start", "process_started") and process.name ==
"mshta.exe" and process.parent.name !=
"Microsoft.ConfigurationManagement.exe" and
process.parent.executable not in ("C:\\Amazon\\Amazon
Assistant\\amazonAssistantService.exe",
"C:\\TeamViewer\\TeamViewer.exe") and process.args !=
"ADSelfService_Enroll.hta"] [network where process.name ==
"mshta.exe"]
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Defense Evasion
** ID: TA0005
** Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
** Name: Mshta
** ID: T1170
** Reference URL: https://attack.mitre.org/techniques/T1170/
