[[peripheral-device-discovery]]
=== Peripheral Device Discovery

Identifies use of the Windows file system utility (fsutil.exe ) to gather information about attached peripheral devices and components connected to a computer system.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*

*Severity*: low

*Risk score*: 21

*Runs every*: 5 minutes

*Searches indices from*: now-6m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Discovery

*Version*: 2 (<<peripheral-device-discovery-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 7.11.2

*Rule authors*: Elastic

*Rule license*: Elastic License

==== Rule query


[source,js]
----------------------------------
process where event.type in ("start", "process_started") and
(process.name : "fsutil.exe" or process.pe.original_file_name ==
"fsutil.exe") and process.args : "fsinfo" and process.args :
"drives"
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Discovery
** ID: TA0007
** Reference URL: https://attack.mitre.org/tactics/TA0007/
* Technique:
** Name: Peripheral Device Discovery
** ID: T1120
** Reference URL: https://attack.mitre.org/techniques/T1120/

[[peripheral-device-discovery-history]]
==== Rule version history

Version 2 (7.11.2 release)::
* Formatting only

