[[persistent-scripts-in-the-startup-directory]]
=== Persistent Scripts in the Startup Directory

Identifies script engines creating files in the startup folder, or the creation of script files in the startup folder.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-6m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Persistence

*Version*: 2 (<<persistent-scripts-in-the-startup-directory-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 7.11.2

*Rule authors*: Elastic

*Rule license*: Elastic License

==== Rule query


[source,js]
----------------------------------
file where event.type != "deletion" and user.domain != "NT AUTHORITY"
and /* detect shortcuts created by wscript.exe or cscript.exe */
(file.path : "C:\\*\\Programs\\Startup\\*.lnk" and process.name :
("wscript.exe", "cscript.exe")) or /* detect vbs or js files
created by any process */ file.path :
("C:\\*\\Programs\\Startup\\*.vbs",
"C:\\*\\Programs\\Startup\\*.vbe",
"C:\\*\\Programs\\Startup\\*.wsh",
"C:\\*\\Programs\\Startup\\*.wsf",
"C:\\*\\Programs\\Startup\\*.js")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Persistence
** ID: TA0003
** Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
** Name: Boot or Logon Autostart Execution
** ID: T1547
** Reference URL: https://attack.mitre.org/techniques/T1547/

[[persistent-scripts-in-the-startup-directory-history]]
==== Rule version history

Version 2 (7.11.2 release)::
* Formatting only

