[[persistence-via-folder-action-script]]
=== Persistence via Folder Action Script

Detects modification of a Folder Action script. A Folder Action script is executed when the folder to which it is attached has items added or removed, or when its window is opened, closed, moved, or resized. Adversaries may abuse this feature to establish persistence by utilizing a malicious script.

*Rule type*: eql

*Rule indices*:

* auditbeat-*
* logs-endpoint.events.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://posts.specterops.io/folder-actions-for-persistence-on-macos-8923f222343d

*Tags*:

* Elastic
* Host
* macOS
* Threat Detection
* Execution
* Persistence

*Version*: 100 (<<persistence-via-folder-action-script-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Rule query


[source,js]
----------------------------------
sequence by host.id with maxspan=5s [process where event.type in
("start", "process_started", "info") and process.name ==
"com.apple.foundation.UserScriptService"] by process.pid [process
where event.type in ("start", "process_started") and process.name in
("osascript", "python", "tcl", "node", "perl", "ruby", "php", "bash",
"csh", "zsh", "sh") and not process.args :
"/Users/*/Library/Application
Support/iTerm2/Scripts/AutoLaunch/*.scpt" ] by process.parent.pid
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Persistence
** ID: TA0003
** Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
** Name: Boot or Logon Initialization Scripts
** ID: T1037
** Reference URL: https://attack.mitre.org/techniques/T1037/


* Tactic:
** Name: Execution
** ID: TA0002
** Reference URL: https://attack.mitre.org/tactics/TA0002/
* Technique:
** Name: Command and Scripting Interpreter
** ID: T1059
** Reference URL: https://attack.mitre.org/techniques/T1059/

[[persistence-via-folder-action-script-history]]
==== Rule version history

Version 100 (8.5.0 release)::
* Formatting only

Version 7 (8.4.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
sequence by host.id with maxspan=5s [process where event.type in
("start", "process_started", "info") and process.name ==
"com.apple.foundation.UserScriptService"] by process.pid [process
where event.type in ("start", "process_started") and process.name in
("osascript", "python", "tcl", "node", "perl", "ruby", "php", "bash",
"csh", "zsh", "sh")] by process.parent.pid
----------------------------------

Version 5 (8.2.0 release)::
* Formatting only

Version 4 (8.0.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
sequence by host.id with maxspan=5s [process where event.type in
("start", "process_started", "info") and process.name ==
"com.apple.foundation.UserScriptService"] by process.pid [process
where event.type in ("start", "process_started") and process.name in
("osascript", "sh")] by process.parent.pid
----------------------------------

Version 3 (7.14.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
sequence by host.id with maxspan=5s [process where event.type in
("start", "process_started", "info") and process.name ==
"com.apple.foundation.UserScriptService"] by process.pid [process
where event.type in ("start", "process_started") and process.name in
("osascript", "sh")] by process.ppid
----------------------------------

Version 2 (7.12.0 release)::
* Formatting only

