[[persistence-via-bits-job-notify-cmdline]]
=== Persistence via BITS Job Notify Cmdline

An adversary can use the Background Intelligent Transfer Service (BITS) SetNotifyCmdLine method to execute a program that runs after a job finishes transferring data or after a job enters a specified state in order to persist on a system.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* winlogbeat-*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://pentestlab.blog/2019/10/30/persistence-bits-jobs/
* https://docs.microsoft.com/en-us/windows/win32/api/bits1_5/nf-bits1_5-ibackgroundcopyjob2-setnotifycmdline
* https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/bitsadmin-setnotifycmdline
* https://www.elastic.co/blog/hunting-for-persistence-using-elastic-security-part-2

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Persistence

*Version*: 4 (<<persistence-via-bits-job-notify-cmdline-history, version history>>)

*Added ({stack} release)*: 7.13.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.parent.name :
"svchost.exe" and process.parent.args : "BITS" and not
process.executable :
("?:\\Windows\\System32\\WerFaultSecure.exe",
"?:\\Windows\\System32\\WerFault.exe",
"?:\\Windows\\System32\\wermgr.exe",
"?:\\WINDOWS\\system32\\directxdatabaseupdater.exe")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Persistence
** ID: TA0003
** Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
** Name: BITS Jobs
** ID: T1197
** Reference URL: https://attack.mitre.org/techniques/T1197/

[[persistence-via-bits-job-notify-cmdline-history]]
==== Rule version history

Version 4 (8.4.0 release)::
* Formatting only

Version 2 (8.2.0 release)::
* Formatting only

