[[potential-credential-access-via-renamed-com-services-dll]]
=== Potential Credential Access via Renamed COM+ Services DLL

Identifies suspicious renamed COMSVCS.DLL Image Load, which exports the MiniDump function that can be used to dump a process memory. This may indicate an attempt to dump LSASS memory while bypassing command-line based detection in preparation for credential access.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-windows.*

*Severity*: high

*Risk score*: 73

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://modexp.wordpress.com/2019/08/30/minidumpwritedump-via-com-services-dll/

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Credential Access

*Version*: 5 (<<potential-credential-access-via-renamed-com-services-dll-history, version history>>)

*Added ({stack} release)*: 8.0.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
sequence by process.entity_id with maxspan=1m [process where
event.category == "process" and process.name : "rundll32.exe"]
[process where event.category == "process" and event.dataset :
"windows.sysmon_operational" and event.code == "7" and
(file.pe.original_file_name : "COMSVCS.DLL" or file.pe.imphash :
"EADBCCBB324829ACB5F2BBE87E5549A8") and /* renamed COMSVCS */
not file.name : "COMSVCS.DLL"]
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Credential Access
** ID: TA0006
** Reference URL: https://attack.mitre.org/tactics/TA0006/
* Technique:
** Name: OS Credential Dumping
** ID: T1003
** Reference URL: https://attack.mitre.org/techniques/T1003/

[[potential-credential-access-via-renamed-com-services-dll-history]]
==== Rule version history

Version 5 (8.4.0 release)::
* Formatting only

Version 3 (8.2.0 release)::
* Formatting only

Version 2 (8.1.0 release)::
* Formatting only

