[[potential-abuse-of-repeated-mfa-push-notifications]]
=== Potential Abuse of Repeated MFA Push Notifications

Detects when an attacker abuses the Multi-Factor authentication mechanism by repeatedly issuing login requests until the user eventually accepts the Okta push notification. An adversary may attempt to bypass the Okta MFA policies configured for an organization to obtain unauthorized access.

*Rule type*: eql

*Rule indices*:

* filebeat-*
* logs-okta*

*Severity*: high

*Risk score*: 73

*Runs every*: 5 minutes

*Searches indices from*: now-6m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://www.mandiant.com/resources/russian-targeting-gov-business

*Tags*:

* Elastic
* Identity
* Okta
* Continuous Monitoring
* SecOps
* Identity and Access

*Version*: 100 (<<potential-abuse-of-repeated-mfa-push-notifications-history, version history>>)

*Added ({stack} release)*: 8.1.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
sequence by user.email with maxspan=10m [any where event.module ==
"okta" and event.action == "user.mfa.okta_verify.deny_push"] [any
where event.module == "okta" and event.action ==
"user.mfa.okta_verify.deny_push"] [any where event.module == "okta"
and event.action == "user.authentication.sso"]
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Credential Access
** ID: TA0006
** Reference URL: https://attack.mitre.org/tactics/TA0006/
* Technique:
** Name: Brute Force
** ID: T1110
** Reference URL: https://attack.mitre.org/techniques/T1110/

[[potential-abuse-of-repeated-mfa-push-notifications-history]]
==== Rule version history

Version 100 (8.5.0 release)::
* Formatting only

Version 4 (8.4.0 release)::
* Formatting only

Version 2 (8.2.0 release)::
* Formatting only

