[[potential-credential-access-via-duplicatehandle-in-lsass]]
=== Potential Credential Access via DuplicateHandle in LSASS

Identifies suspicious access to an LSASS handle via DuplicateHandle from an unknown call trace module. This may indicate an attempt to bypass the NtOpenProcess API to evade detection and dump LSASS memory for credential access.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://github.com/CCob/MirrorDump

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Credential Access

*Version*: 5 (<<potential-credential-access-via-duplicatehandle-in-lsass-history, version history>>)

*Added ({stack} release)*: 7.16.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.code == "10" and /* LSASS requesting
DuplicateHandle access right to another process */ process.name :
"lsass.exe" and winlog.event_data.GrantedAccess == "0x40" and /*
call is coming from an unknown executable region */
winlog.event_data.CallTrace : "*UNKNOWN*"
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Credential Access
** ID: TA0006
** Reference URL: https://attack.mitre.org/tactics/TA0006/
* Technique:
** Name: OS Credential Dumping
** ID: T1003
** Reference URL: https://attack.mitre.org/techniques/T1003/

[[potential-credential-access-via-duplicatehandle-in-lsass-history]]
==== Rule version history

Version 5 (8.4.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.code == "10" and /* LSASS requesting
DuplicateHandle access right to another process */ process.name :
"lsass.exe" and winlog.event_data.GrantedAccess == "0x40" and /*
call is coming from an unknown executable region */
winlog.event_data.CallTrace : "*UNKNOWN*"
----------------------------------

Version 3 (8.2.0 release)::
* Formatting only

Version 2 (8.0.0 release)::
* Formatting only

