[[potential-local-ntlm-relay-via-http]]
=== Potential Local NTLM Relay via HTTP

Identifies attempt to coerce a local NTLM authentication via HTTP using the Windows Printer Spooler service as a target. An adversary may use this primitive in combination with other techniques to elevate privileges on a compromised system.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*
* endgame-*

*Severity*: high

*Risk score*: 73

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://github.com/med0x2e/NTLMRelay2Self
* https://github.com/topotam/PetitPotam
* https://github.com/dirkjanm/krbrelayx/blob/master/printerbug.py

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Credential Access
* Elastic Endgame

*Version*: 102 (<<potential-local-ntlm-relay-via-http-history, version history>>)

*Added ({stack} release)*: 8.3.0

*Last modified ({stack} release)*: 8.6.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.name :
"rundll32.exe" and /* Rundll32 WbeDav Client */ process.args :
("?:\\Windows\\System32\\davclnt.dll,DavSetCookie",
"?:\\Windows\\SysWOW64\\davclnt.dll,DavSetCookie") and /* Access to
named pipe via http */ process.args : ("http*/print/pipe/*",
"http*/pipe/spoolss", "http*/pipe/srvsvc")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Credential Access
** ID: TA0006
** Reference URL: https://attack.mitre.org/tactics/TA0006/
* Technique:
** Name: Exploitation for Credential Access
** ID: T1212
** Reference URL: https://attack.mitre.org/techniques/T1212/

[[potential-local-ntlm-relay-via-http-history]]
==== Rule version history

Version 102 (8.6.0 release)::
* Formatting only

Version 101 (8.5.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
process.name : "rundll32.exe" and /* Rundll32 WbeDav Client */
process.args : ("?:\\Windows\\System32\\davclnt.dll,DavSetCookie",
"?:\\Windows\\SysWOW64\\davclnt.dll,DavSetCookie") and /* Access
to named pipe via http */ process.args : ("http*/print/pipe/*",
"http*/pipe/spoolss", "http*/pipe/srvsvc")
----------------------------------

Version 2 (8.4.0 release)::
* Formatting only

