[[potential-port-monitor-or-print-processor-registration-abuse]]
=== Potential Port Monitor or Print Processor Registration Abuse

Identifies port monitor and print processor registry modifications. Adversaries may abuse port monitor and print processors to run malicious DLLs during system boot that will be executed as SYSTEM for privilege escalation and/or persistence, if permissions allow writing a fully-qualified pathname for that DLL.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://www.welivesecurity.com/2020/05/21/no-game-over-winnti-group/

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Privilege Escalation

*Version*: 3 (<<potential-port-monitor-or-print-processor-registration-abuse-history, version history>>)

*Added ({stack} release)*: 7.12.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Rule query


[source,js]
----------------------------------
registry where event.type in ("creation", "change") and
registry.path :
("HKLM\\SYSTEM\\*ControlSet*\\Control\\Print\\Monitors\\*", "HKLM\
\SYSTEM\\*ControlSet*\\Control\\Print\\Environments\\Windows*\\Print
Processors\\*") and registry.data.strings : "*.dll" and /* exclude
SYSTEM SID - look for changes by non-SYSTEM user */ not user.id :
"S-1-5-18"
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Privilege Escalation
** ID: TA0004
** Reference URL: https://attack.mitre.org/tactics/TA0004/
* Technique:
** Name: Boot or Logon Autostart Execution
** ID: T1547
** Reference URL: https://attack.mitre.org/techniques/T1547/


* Tactic:
** Name: Persistence
** ID: TA0003
** Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
** Name: Boot or Logon Autostart Execution
** ID: T1547
** Reference URL: https://attack.mitre.org/techniques/T1547/

[[potential-port-monitor-or-print-processor-registration-abuse-history]]
==== Rule version history

Version 3 (8.4.0 release)::
* Formatting only

Version 2 (8.1.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
registry where event.type in ("creation", "change") and
registry.path :
("HKLM\\SYSTEM\\*ControlSet*\\Control\\Print\\Monitors\\*", "HLLM\
\SYSTEM\\*ControlSet*\\Control\\Print\\Environments\\Windows*\\Print
Processors\\*") and registry.data.strings : "*.dll" and /* exclude
SYSTEM SID - look for changes by non-SYSTEM user */ not user.id :
"S-1-5-18"
----------------------------------

