[[searching-for-saved-credentials-via-vaultcmd]]
=== Searching for Saved Credentials via VaultCmd

Windows Credential Manager allows you to create, view, or delete saved credentials for signing into websites, connected applications, and networks. An adversary may abuse this to list or dump credentials stored in the Credential Manager for saved usernames and passwords. This may also be performed in preparation of lateral movement.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://medium.com/threatpunter/detecting-adversary-tradecraft-with-image-load-event-logging-and-eql-8de93338c16
* https://web.archive.org/web/20201004080456/https://rastamouse.me/blog/rdp-jump-boxes/

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Credential Access

*Version*: 6 (<<searching-for-saved-credentials-via-vaultcmd-history, version history>>)

*Added ({stack} release)*: 7.12.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type in ("start", "process_started") and
(process.pe.original_file_name:"vaultcmd.exe" or
process.name:"vaultcmd.exe") and process.args:"/list*"
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Credential Access
** ID: TA0006
** Reference URL: https://attack.mitre.org/tactics/TA0006/
* Technique:
** Name: OS Credential Dumping
** ID: T1003
** Reference URL: https://attack.mitre.org/techniques/T1003/

[[searching-for-saved-credentials-via-vaultcmd-history]]
==== Rule version history

Version 6 (8.4.0 release)::
* Formatting only

Version 4 (8.3.0 release)::
* Formatting only

Version 3 (8.2.0 release)::
* Formatting only

Version 2 (7.16.0 release)::
* Formatting only

