[[service-control-spawned-via-script-interpreter]]
=== Service Control Spawned via Script Interpreter

Identifies Service Control (sc.exe) spawning from script interpreter processes to create, modify, or start services. This could be indicative of adversary lateral movement but will be noisy if commonly done by admins.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* logs-system.*
* winlogbeat-*

*Severity*: low

*Risk score*: 21

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Lateral Movement

*Version*: 13 (<<service-control-spawned-via-script-interpreter-history, version history>>)

*Added ({stack} release)*: 7.6.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
/* This rule is not compatible with Sysmon due to user.id issues */
process where event.type == "start" and (process.name : "sc.exe" or
process.pe.original_file_name == "sc.exe") and process.parent.name :
("cmd.exe", "wscript.exe", "rundll32.exe", "regsvr32.exe",
"wmic.exe", "mshta.exe","powershell.exe", "pwsh.exe") and
process.args:("config", "create", "start", "delete", "stop", "pause")
and /* exclude SYSTEM SID - look for service creations by non-SYSTEM
user */ not user.id : "S-1-5-18"
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Lateral Movement
** ID: TA0008
** Reference URL: https://attack.mitre.org/tactics/TA0008/
* Technique:
** Name: Remote Services
** ID: T1021
** Reference URL: https://attack.mitre.org/techniques/T1021/

[[service-control-spawned-via-script-interpreter-history]]
==== Rule version history

Version 13 (8.4.0 release)::
* Formatting only

Version 11 (8.2.0 release)::
* Formatting only

Version 10 (8.1.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type == "start" and (process.name : "sc.exe" or
process.pe.original_file_name == "sc.exe") and process.parent.name :
("cmd.exe", "wscript.exe", "rundll32.exe", "regsvr32.exe",
"wmic.exe", "mshta.exe","powershell.exe", "pwsh.exe") and
process.args:("config", "create", "start", "delete", "stop", "pause")
and /* exclude SYSTEM SID - look for service creations by non-SYSTEM
user */ not user.id : "S-1-5-18"
----------------------------------

Version 9 (7.13.0 release)::
* Rule name changed from: Local Service Commands
+
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:process and event.type:(start or process_started) and
process.name:sc.exe and process.args:(config or create or failure or
start)
----------------------------------

Version 8 (7.12.0 release)::
* Formatting only

Version 7 (7.11.2 release)::
* Formatting only

Version 6 (7.11.0 release)::
* Formatting only

Version 5 (7.10.0 release)::
* Formatting only

Version 4 (7.9.1 release)::
* Formatting only

Version 3 (7.9.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.action:"Process Create (rule: ProcessCreate)" and
process.name:sc.exe and process.args:(config or create or failure or
start)
----------------------------------

Version 2 (7.7.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.action:"Process Create (rule: ProcessCreate)" and
process.name:sc.exe and process.args:("create" or "config" or
"failure" or "start")
----------------------------------

