[[suspicious-werfault-child-process]]
=== Suspicious WerFault Child Process

A suspicious WerFault child process was detected, which may indicate an attempt to run unnoticed. Verify process details such as command line, network connections, file writes and parent process details as well.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*
* endgame-*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://www.hexacorn.com/blog/2019/09/19/silentprocessexit-quick-look-under-the-hood/
* https://github.com/sbousseaden/EVTX-ATTACK-SAMPLES/blob/master/Persistence/persistence_SilentProcessExit_ImageHijack_sysmon_13_1.evtx
* https://web.archive.org/web/20230530011556/https://blog.menasec.net/2021/01/

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Defense Evasion
* Elastic Endgame

*Version*: 102 (<<suspicious-werfault-child-process-history, version history>>)

*Added ({stack} release)*: 7.10.0

*Last modified ({stack} release)*: 8.6.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Potential false positives

Custom Windows error reporting debugger or applications restarted by WerFault after a crash.

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.parent.name :
"WerFault.exe" and not process.name : ("cofire.exe",
"psr.exe", "VsJITDebugger.exe",
"TTTracer.exe", "rundll32.exe",
"LogiOptionsMgr.exe") and not process.args : ("/LOADSAVEDWINDOWS",
"/restore", "RestartByRestartManager*",
"--restarted", "createdump",
"dontsend", "/watson")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Defense Evasion
** ID: TA0005
** Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
** Name: Masquerading
** ID: T1036
** Reference URL: https://attack.mitre.org/techniques/T1036/

[[suspicious-werfault-child-process-history]]
==== Rule version history

Version 102 (8.6.0 release)::
* Formatting only

Version 101 (8.5.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
process.parent.name : "WerFault.exe" and not process.name :
("cofire.exe", "psr.exe",
"VsJITDebugger.exe", "TTTracer.exe",
"rundll32.exe", "LogiOptionsMgr.exe") and not
process.args : ("/LOADSAVEDWINDOWS", "/restore",
"RestartByRestartManager*", "--restarted",
"createdump", "dontsend",
"/watson")
----------------------------------

Version 7 (8.4.0 release)::
* Formatting only

Version 5 (8.2.0 release)::
* Formatting only

Version 4 (7.13.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:process and event.type:(start or process_started) and
process.parent.name:WerFault.exe and not process.name:(cofire.exe or
psr.exe or VsJITDebugger.exe or TTTracer.exe or rundll32.exe)
----------------------------------

Version 3 (7.12.0 release)::
* Formatting only

Version 2 (7.11.2 release)::
* Formatting only

