[[suspicious-java-child-process]]
=== Suspicious JAVA Child Process

Identifies suspicious child processes of the Java interpreter process. This may indicate an attempt to execute a malicious JAR file or an exploitation attempt via a JAVA specific vulnerability.

*Rule type*: eql

*Rule indices*:

* auditbeat-*
* logs-endpoint.events.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://www.lunasec.io/docs/blog/log4j-zero-day/
* https://github.com/christophetd/log4shell-vulnerable-app
* https://www.blackhat.com/docs/us-16/materials/us-16-Munoz-A-Journey-From-JNDI-LDAP-Manipulation-To-RCE.pdf

*Tags*:

* Elastic
* Host
* Linux
* macOS
* Threat Detection
* Execution

*Version*: 6 (<<suspicious-java-child-process-history, version history>>)

*Added ({stack} release)*: 7.12.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type in ("start", "process_started") and
process.parent.name : "java" and process.name : ("sh", "bash",
"dash", "ksh", "tcsh", "zsh", "curl", "wget")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Execution
** ID: TA0002
** Reference URL: https://attack.mitre.org/tactics/TA0002/
* Technique:
** Name: Command and Scripting Interpreter
** ID: T1059
** Reference URL: https://attack.mitre.org/techniques/T1059/

[[suspicious-java-child-process-history]]
==== Rule version history

Version 6 (8.4.0 release)::
* Formatting only

Version 4 (8.2.0 release)::
* Formatting only

Version 3 (8.0.0 release)::
* Rule name changed from: Suspicious JAR Child Process
+
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
process.parent.name : "java" and process.name : ("sh", "bash",
"dash", "ksh", "tcsh", "zsh", "curl", "wget") and process.args :
"-jar" and process.args : "*.jar" and /* Add any FP's here */ not
process.executable : ("/Users/*/.sdkman/*",
"/Library/Java/JavaVirtualMachines/*") and not process.args :
("/usr/local/*", "/Users/*/github.com/*", "/Users/*/src/*")
----------------------------------

Version 2 (7.15.0 release)::
* Formatting only

