[[suspicious-zoom-child-process]]
=== Suspicious Zoom Child Process

A suspicious Zoom child process was detected, which may indicate an attempt to run unnoticed. Verify process details such as command line, network connections, file writes and associated file signature details as well.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Defense Evasion

*Version*: 8 (<<suspicious-zoom-child-process-history, version history>>)

*Added ({stack} release)*: 7.10.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type in ("start", "process_started", "info") and
process.parent.name : "Zoom.exe" and process.name : ("cmd.exe",
"powershell.exe", "pwsh.exe", "powershell_ise.exe")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Defense Evasion
** ID: TA0005
** Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
** Name: Masquerading
** ID: T1036
** Reference URL: https://attack.mitre.org/techniques/T1036/

[[suspicious-zoom-child-process-history]]
==== Rule version history

Version 8 (8.4.0 release)::
* Formatting only

Version 6 (8.2.0 release)::
* Formatting only

Version 5 (7.16.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started", "info") and
process.parent.name : "Zoom.exe" and process.name : ("cmd.exe",
"powershell.exe", "pwsh.exe")
----------------------------------

Version 4 (7.12.0 release)::
* Formatting only

Version 3 (7.11.2 release)::
* Formatting only

Version 2 (7.11.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:process and event.type:(start or process_started) and
process.parent.name:Zoom.exe and not process.name:(Zoom.exe or
WerFault.exe or airhost.exe or CptControl.exe or CptHost.exe or
cpthost.exe or CptInstall.exe or CptService.exe or Installer.exe or
zCrashReport.exe or Zoom_launcher.exe or zTscoder.exe or
plugin_Launcher.exe or mDNSResponder.exe or zDevHelper.exe or
APcptControl.exe or CrashSender*.exe or aomhost64.exe or Magnify.exe
or m_plugin_launcher.exe or com.zoom.us.zTranscode.exe or
RoomConnector.exe or tabtip.exe or Explorer.exe or chrome.exe or
firefox.exe or iexplore.exe or outlook.exe or lync.exe or
ApplicationFrameHost.exe or ZoomAirhostInstaller.exe or narrator.exe
or NVDA.exe or Magnify.exe or Outlook.exe or m_plugin_launcher.exe or
mphost.exe or APcptControl.exe or winword.exe or excel.exe or
powerpnt.exe or ONENOTE.EXE or wpp.exe or debug_message.exe or
zAssistant.exe or msiexec.exe or msedge.exe or dwm.exe or
vcredist_x86.exe or Controller.exe or Installer.exe or CptInstall.exe
or Zoom_launcher.exe or ShellExperienceHost.exe or wps.exe)
----------------------------------

