[[suspicious-explorer-child-process]]
=== Suspicious Explorer Child Process

Identifies a suspicious Windows explorer child process. Explorer.exe can be abused to launch malicious scripts or executables from a trusted parent process.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* winlogbeat-*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Initial Access

*Version*: 7 (<<suspicious-explorer-child-process-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type in ("start", "process_started") and (
process.name : ("cscript.exe", "wscript.exe", "powershell.exe",
"rundll32.exe", "cmd.exe", "mshta.exe", "regsvr32.exe") or
process.pe.original_file_name in ("cscript.exe", "wscript.exe",
"PowerShell.EXE", "RUNDLL32.EXE", "Cmd.Exe", "MSHTA.EXE",
"REGSVR32.EXE") ) and /* Explorer started via DCOM */
process.parent.name : "explorer.exe" and process.parent.args :
"-Embedding" and not process.parent.args: ( /*
Noisy CLSID_SeparateSingleProcessExplorerHost Explorer COM Class IDs
*/ "/factory,{5BD95610-9434-43C2-886C-57852CC8A120}",
"/factory,{ceff45ee-c862-41de-aee2-a022c81eda92}" )
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Initial Access
** ID: TA0001
** Reference URL: https://attack.mitre.org/tactics/TA0001/
* Technique:
** Name: Phishing
** ID: T1566
** Reference URL: https://attack.mitre.org/techniques/T1566/

[[suspicious-explorer-child-process-history]]
==== Rule version history

Version 7 (8.4.0 release)::
* Formatting only

Version 5 (8.2.0 release)::
* Formatting only

Version 4 (7.13.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
process.name : ("cscript.exe", "wscript.exe", "powershell.exe",
"rundll32.exe", "cmd.exe", "mshta.exe", "regsvr32.exe") and /*
Explorer started via DCOM */ process.parent.name : "explorer.exe"
and process.parent.args : "-Embedding"
----------------------------------

Version 3 (7.12.0 release)::
* Formatting only

Version 2 (7.11.2 release)::
* Formatting only

