[[suspicious-wmic-xsl-script-execution]]
=== Suspicious WMIC XSL Script Execution

Identifies WMIC whitelisting bypass techniques by alerting on suspicious execution of scripts. When WMIC loads scripting libraries it may be indicative of a whitelist bypass.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* winlogbeat-*

*Severity*: medium

*Risk score*: 21

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Windows

*Version*: 1

*Added ({stack} release)*: 7.10.0

*Rule authors*: Elastic

*Rule license*: Elastic License

==== Rule query


[source,js]
----------------------------------
/* lots of wildcards in the args need to verify args cleanup is
accurate */ sequence by process.entity_id with maxspan=2m [process
where event.type in ("start", "process_started") and (process.name
== "wmic.exe" or process.pe.original_file_name == "wmic.exe") and
wildcard(process.args, "format*:*", "/format*:*", "*-format*:*") and
not process.args in ("/format:table", "/format:table") or
wildcard(process.args, "format*:*")] [library where event.type ==
"start" and file.name in ("jscript.dll", "vbscript.dll")]
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Defense Evasion
** ID: TA0005
** Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
** Name: XSL Script Processing
** ID: T1220
** Reference URL: https://attack.mitre.org/techniques/T1220/
