[[suspicious-dll-loaded-for-persistence-or-privilege-escalation]]
=== Suspicious DLL Loaded for Persistence or Privilege Escalation

Identifies the loading of a non Microsoft signed DLL that is missing on a default Windows install (phantom DLL) or one that can be loaded from a different location by a native Windows process. This may be abused to persist or elevate privileges via privileged file write vulnerabilities.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: high

*Risk score*: 73

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://itm4n.github.io/windows-dll-hijacking-clarified/
* http://remoteawesomethoughts.blogspot.com/2019/05/windows-10-task-schedulerservice.html
* https://googleprojectzero.blogspot.com/2018/04/windows-exploitation-tricks-exploiting.html
* https://shellz.club/2020/10/16/edgegdi-dll-for-persistence-and-lateral-movement.html
* https://windows-internals.com/faxing-your-way-to-system/
* http://waleedassar.blogspot.com/2013/01/wow64logdll.html

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Persistence
* Privilege Escalation

*Version*: 100 (<<suspicious-dll-loaded-for-persistence-or-privilege-escalation-history, version history>>)

*Added ({stack} release)*: 7.12.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
any where (event.category == "library" or (event.category ==
"process" and event.action : "Image loaded*")) and ( /* compatible
with Elastic Endpoint Library Events */ (dll.name : ("wlbsctrl.dll",
"wbemcomn.dll", "WptsExtensions.dll", "Tsmsisrv.dll", "TSVIPSrv.dll",
"Msfte.dll", "wow64log.dll",
"WindowsCoreDeviceInfo.dll", "Ualapi.dll", "wlanhlp.dll",
"phoneinfo.dll", "EdgeGdi.dll", "cdpsgshims.dll",
"windowsperformancerecordercontrol.dll", "diagtrack_win.dll") and
(dll.code_signature.trusted == false or dll.code_signature.exists ==
false)) or /* compatible with Sysmon EventID 7 - Image Load */
(file.name : ("wlbsctrl.dll", "wbemcomn.dll", "WptsExtensions.dll",
"Tsmsisrv.dll", "TSVIPSrv.dll", "Msfte.dll",
"wow64log.dll", "WindowsCoreDeviceInfo.dll", "Ualapi.dll",
"wlanhlp.dll", "phoneinfo.dll", "EdgeGdi.dll",
"cdpsgshims.dll", "windowsperformancerecordercontrol.dll",
"diagtrack_win.dll") and not file.code_signature.status == "Valid")
)
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Privilege Escalation
** ID: TA0004
** Reference URL: https://attack.mitre.org/tactics/TA0004/
* Technique:
** Name: Hijack Execution Flow
** ID: T1574
** Reference URL: https://attack.mitre.org/techniques/T1574/


* Tactic:
** Name: Persistence
** ID: TA0003
** Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
** Name: Hijack Execution Flow
** ID: T1574
** Reference URL: https://attack.mitre.org/techniques/T1574/

[[suspicious-dll-loaded-for-persistence-or-privilege-escalation-history]]
==== Rule version history

Version 100 (8.5.0 release)::
* Formatting only

Version 6 (8.4.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
library where dll.name : ( "wlbsctrl.dll", "wbemcomn.dll",
"WptsExtensions.dll", "Tsmsisrv.dll", "TSVIPSrv.dll",
"Msfte.dll", "wow64log.dll", "WindowsCoreDeviceInfo.dll",
"Ualapi.dll", "wlanhlp.dll", "phoneinfo.dll", "EdgeGdi.dll",
"cdpsgshims.dll", "windowsperformancerecordercontrol.dll",
"diagtrack_win.dll" ) and not (dll.code_signature.subject_name :
("Microsoft Windows", "Microsoft Corporation") and
dll.code_signature.status : "trusted")
----------------------------------

Version 4 (8.3.0 release)::
* Formatting only

Version 3 (8.2.0 release)::
* Formatting only

Version 2 (7.14.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
library where dll.name : ( "wlbsctrl.dll", "wbemcomn.dll",
"WptsExtensions.dll", "Tsmsisrv.dll", "TSVIPSrv.dll",
"Msfte.dll", "wow64log.dll", "WindowsCoreDeviceInfo.dll",
"Ualapi.dll", "wlanhlp.dll", "phoneinfo.dll", "EdgeGdi.dll",
"cdpsgshims.dll", "windowsperformancerecordercontrol.dll",
"diagtrack_win.dll" ) and not (dll.code_signature.subject_name :
"Microsoft Windows" and dll.code_signature.status : "trusted")
----------------------------------

