[[suspicious-.net-code-compilation]]
=== Suspicious .NET Code Compilation

Identifies suspicious .NET code execution. connections.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Defense Evasion

*Version*: 101 (<<suspicious-.net-code-compilation-history, version history>>)

*Added ({stack} release)*: 7.10.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.name : ("csc.exe",
"vbc.exe") and process.parent.name : ("wscript.exe", "mshta.exe",
"cscript.exe", "wmic.exe", "svchost.exe", "rundll32.exe", "cmstp.exe",
"regsvr32.exe")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Defense Evasion
** ID: TA0005
** Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
** Name: Obfuscated Files or Information
** ID: T1027
** Reference URL: https://attack.mitre.org/techniques/T1027/

[[suspicious-.net-code-compilation-history]]
==== Rule version history

Version 101 (8.5.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
process.name : ("csc.exe", "vbc.exe") and process.parent.name :
("wscript.exe", "mshta.exe", "cscript.exe", "wmic.exe", "svchost.exe",
"rundll32.exe", "cmstp.exe", "regsvr32.exe")
----------------------------------

Version 8 (8.4.0 release)::
* Formatting only

Version 6 (8.2.0 release)::
* Formatting only

Version 5 (7.16.0 release)::
* Formatting only

Version 4 (7.12.0 release)::
* Formatting only

Version 3 (7.11.2 release)::
* Formatting only

Version 2 (7.11.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:process and event.type:(start or process_started) and
process.name:(csc.exe or vbc.exe) and process.parent.name:(wscript.exe
or mshta.exe or wscript.exe or wmic.exe or svchost.exe or rundll32.exe
or cmstp.exe or regsvr32.exe)
----------------------------------

