[[suspicious-print-spooler-file-deletion]]
=== Suspicious Print Spooler File Deletion

Detects deletion of print driver files by an unusual process. This may indicate a clean up attempt post successful privilege escalation via Print Spooler service related vulnerabilities.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://msrc.microsoft.com/update-guide/vulnerability/CVE-2021-34527

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Privilege Escalation

*Version*: 100 (<<suspicious-print-spooler-file-deletion-history, version history>>)

*Added ({stack} release)*: 7.14.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Potential false positives

Uninstall or manual deletion of a legitimate printing driver files. Verify the printer file metadata such as manufacturer and signature information.

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
file where event.type : "deletion" and not process.name :
("spoolsv.exe", "dllhost.exe", "explorer.exe") and file.path :
"?:\\Windows\\System32\\spool\\drivers\\x64\\3\\*.dll"
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Privilege Escalation
** ID: TA0004
** Reference URL: https://attack.mitre.org/tactics/TA0004/
* Technique:
** Name: Exploitation for Privilege Escalation
** ID: T1068
** Reference URL: https://attack.mitre.org/techniques/T1068/

[[suspicious-print-spooler-file-deletion-history]]
==== Rule version history

Version 100 (8.5.0 release)::
* Formatting only

Version 5 (8.4.0 release)::
* Formatting only

Version 3 (8.3.0 release)::
* Formatting only

Version 2 (8.2.0 release)::
* Formatting only

