[[suspicious-crontab-creation-or-modification]]
=== Suspicious CronTab Creation or Modification

Identifies attempts to create or modify a crontab via a process that is not crontab (i.e python, osascript, etc.). This activity should not be highly prevalent and could indicate the use of cron as a persistence mechanism by a threat actor.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://taomm.org/PDFs/vol1/CH%200x02%20Persistence.pdf
* https://theevilbit.github.io/beyond/beyond_0004/

*Tags*:

* Elastic
* Host
* macOS
* Threat Detection
* Persistence

*Version*: 2 (<<suspicious-crontab-creation-or-modification-history, version history>>)

*Added ({stack} release)*: 8.3.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Rule query


[source,js]
----------------------------------
file where event.type != "deletion" and process.name != null and
file.path : "/private/var/at/tabs/*" and not process.executable ==
"/usr/bin/crontab"
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Persistence
** ID: TA0003
** Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
** Name: Scheduled Task/Job
** ID: T1053
** Reference URL: https://attack.mitre.org/techniques/T1053/

[[suspicious-crontab-creation-or-modification-history]]
==== Rule version history

Version 2 (8.4.0 release)::
* Formatting only

