[[suspicious-browser-child-process]]
=== Suspicious Browser Child Process

Identifies the execution of a suspicious browser child process. Adversaries may gain access to a system through a user visiting a website over the normal course of browsing. With this technique, the user's web browser is typically targeted for exploitation.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*

*Severity*: high

*Risk score*: 73

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://objective-see.com/blog/blog_0x43.html
* https://fr.slideshare.net/codeblue_jp/cb19-recent-apt-attack-on-crypto-exchange-employees-by-heungsoo-kang

*Tags*:

* Elastic
* Host
* macOS
* Threat Detection
* Initial Access
* Execution

*Version*: 2 (<<suspicious-browser-child-process-history, version history>>)

*Added ({stack} release)*: 7.12.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Rule query


[source,js]
----------------------------------
process where event.type in ("start", "process_started") and
process.parent.name : ("Google Chrome", "Google Chrome Helper*",
"firefox", "Opera", "Safari", "com.apple.WebKit.WebContent",
"Microsoft Edge") and process.name : ("sh", "bash", "dash", "ksh",
"tcsh", "zsh", "curl", "wget", "python*", "perl*", "php*",
"osascript", "pwsh") and process.command_line != null and not
process.args : ( "/Library/Application
Support/Microsoft/MAU*/Microsoft
AutoUpdate.app/Contents/MacOS/msupdate", "hw.model",
"IOPlatformExpertDevice", "/Volumes/Google Chrome/Google
Chrome.app/Contents/Frameworks/*/Resources/install.sh", "--
defaults-torrc", "Chrome.app", "Framework.framework/Vers
ions/*/Resources/keystone_promote_preflight.sh",
"/Users/*/Library/Application
Support/Google/Chrome/recovery/*/ChromeRecovery", "$DISPLAY",
"GIO_LAUNCHED_DESKTOP_FILE_PID=$$" )
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Execution
** ID: TA0002
** Reference URL: https://attack.mitre.org/tactics/TA0002/
* Technique:
** Name: Exploitation for Client Execution
** ID: T1203
** Reference URL: https://attack.mitre.org/techniques/T1203/


* Tactic:
** Name: Initial Access
** ID: TA0001
** Reference URL: https://attack.mitre.org/tactics/TA0001/
* Technique:
** Name: Drive-by Compromise
** ID: T1189
** Reference URL: https://attack.mitre.org/techniques/T1189/

[[suspicious-browser-child-process-history]]
==== Rule version history

Version 2 (8.4.0 release)::
* Formatting only

