[[uac-bypass-attempt-via-windows-directory-masquerading]]
=== UAC Bypass Attempt via Windows Directory Masquerading

Identifies an attempt to bypass User Account Control (UAC) by masquerading as a Microsoft trusted Windows directory. Attackers may bypass UAC to stealthily execute code with elevated permissions.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*

*Severity*: high

*Risk score*: 71

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://medium.com/tenable-techblog/uac-bypass-by-mocking-trusted-directories-24a96675f6e

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Privilege Escalation

*Version*: 2 (<<uac-bypass-attempt-via-windows-directory-masquerading-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 7.11.2

*Rule authors*: Elastic

*Rule license*: Elastic License

==== Rule query


[source,js]
----------------------------------
process where event.type in ("start", "process_started") and
process.args : ("C:\\Windows \\system32\\*.exe", "C:\\Windows
\\SysWOW64\\*.exe")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Privilege Escalation
** ID: TA0004
** Reference URL: https://attack.mitre.org/tactics/TA0004/
* Technique:
** Name: Abuse Elevation Control Mechanism
** ID: T1548
** Reference URL: https://attack.mitre.org/techniques/T1548/

[[uac-bypass-attempt-via-windows-directory-masquerading-history]]
==== Rule version history

Version 2 (7.11.2 release)::
* Formatting only

