[[uac-bypass-attempt-via-privileged-ifileoperation-com-interface]]
=== UAC Bypass Attempt via Privileged IFileOperation COM Interface

Identifies attempts to bypass User Account Control (UAC) via DLL side-loading. Attackers may attempt to bypass UAC to stealthily execute code with elevated permissions.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: high

*Risk score*: 73

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://github.com/hfiref0x/UACME
* https://www.elastic.co/security-labs/exploring-windows-uac-bypasses-techniques-and-detection-strategies

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Privilege Escalation

*Version*: 101 (<<uac-bypass-attempt-via-privileged-ifileoperation-com-interface-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 8.6.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
file where event.type : "change" and process.name : "dllhost.exe" and
/* Known modules names side loaded into process running with high or
system integrity level for UAC Bypass, update here for new modules */
file.name : ("wow64log.dll", "comctl32.dll", "DismCore.dll",
"OskSupport.dll", "duser.dll", "Accessibility.ni.dll") and /* has no
impact on rule logic just to avoid OS install related FPs */ not
file.path : ("C:\\Windows\\SoftwareDistribution\\*",
"C:\\Windows\\WinSxS\\*")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Privilege Escalation
** ID: TA0004
** Reference URL: https://attack.mitre.org/tactics/TA0004/
* Technique:
** Name: Abuse Elevation Control Mechanism
** ID: T1548
** Reference URL: https://attack.mitre.org/techniques/T1548/

[[uac-bypass-attempt-via-privileged-ifileoperation-com-interface-history]]
==== Rule version history

Version 101 (8.6.0 release)::
* Formatting only

Version 100 (8.5.0 release)::
* Formatting only

Version 7 (8.4.0 release)::
* Formatting only

Version 5 (8.2.0 release)::
* Formatting only

Version 4 (7.15.0 release)::
* Formatting only

Version 3 (7.12.0 release)::
* Formatting only

Version 2 (7.11.2 release)::
* Formatting only

