[[unusual-service-host-child-process-childless-service]]
=== Unusual Service Host Child Process - Childless Service

Identifies unusual child processes of Service Host (svchost.exe) that traditionally do not spawn any child processes. This may indicate a code injection or an equivalent form of exploitation.

*Rule type*: eql

*Rule indices*:

* logs-endpoint.events.*
* winlogbeat-*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Defense Evasion
* Privilege Escalation

*Version*: 101 (<<unusual-service-host-child-process-childless-service-history, version history>>)

*Added ({stack} release)*: 7.11.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Potential false positives

Changes to Windows services or a rarely executed child process.

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.parent.name :
"svchost.exe" and /* based on svchost service arguments -s
svcname where the service is known to be childless */
process.parent.args : ("WdiSystemHost","LicenseManager",
"StorSvc","CDPSvc","cdbhsvc","BthAvctpSvc","SstpSvc","WdiServiceHost",
"imgsvc","TrkWks","WpnService","IKEEXT","PolicyAgent","CryptSvc",
"netprofm","ProfSvc","StateRepository","camsvc","LanmanWorkstation",
"NlaSvc","EventLog","hidserv","DisplayEnhancementService","ShellHWDete
ction", "AppHostSvc","fhsvc","CscService","PushToInstall") and
/* unknown FPs can be added here */ not process.name :
("WerFault.exe","WerFaultSecure.exe","wermgr.exe") and not
(process.executable : "?:\\Windows\\System32\\RelPost.exe" and
process.parent.args : "WdiSystemHost") and not (process.name :
"rundll32.exe" and process.args :
"?:\\WINDOWS\\System32\\winethc.dll,ForceProxyDetectionOnNextRun" and
process.parent.args : "WdiServiceHost") and not
(process.executable : ("?:\\Program Files\\*", "?:\\Program Files
(x86)\\*", "?:\\Windows\\System32\\Kodak\\kds_i4x50\\lib\\lexexe.exe")
and process.parent.args : "imgsvc")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Privilege Escalation
** ID: TA0004
** Reference URL: https://attack.mitre.org/tactics/TA0004/
* Technique:
** Name: Process Injection
** ID: T1055
** Reference URL: https://attack.mitre.org/techniques/T1055/


* Tactic:
** Name: Defense Evasion
** ID: TA0005
** Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
** Name: Process Injection
** ID: T1055
** Reference URL: https://attack.mitre.org/techniques/T1055/

[[unusual-service-host-child-process-childless-service-history]]
==== Rule version history

Version 101 (8.5.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
process.parent.name : "svchost.exe" and /* based on svchost
service arguments -s svcname where the service is known to be
childless */ process.parent.args :
("WdiSystemHost","LicenseManager",
"StorSvc","CDPSvc","cdbhsvc","BthAvctpSvc","SstpSvc","WdiServiceHost",
"imgsvc","TrkWks","WpnService","IKEEXT","PolicyAgent","CryptSvc",
"netprofm","ProfSvc","StateRepository","camsvc","LanmanWorkstation",
"NlaSvc","EventLog","hidserv","DisplayEnhancementService","ShellHWDete
ction", "AppHostSvc","fhsvc","CscService","PushToInstall") and
/* unknown FPs can be added here */ not process.name :
("WerFault.exe","WerFaultSecure.exe","wermgr.exe") and not
(process.executable : "?:\\Windows\\System32\\RelPost.exe" and
process.parent.args : "WdiSystemHost") and not (process.name :
"rundll32.exe" and process.args :
"?:\\WINDOWS\\System32\\winethc.dll,ForceProxyDetectionOnNextRun" and
process.parent.args : "WdiServiceHost") and not
(process.executable : ("?:\\Program Files\\*", "?:\\Program Files
(x86)\\*", "?:\\Windows\\System32\\Kodak\\kds_i4x50\\lib\\lexexe.exe")
and process.parent.args : "imgsvc")
----------------------------------

Version 6 (8.4.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
process.parent.name : "svchost.exe" and /* based on svchost
service arguments -s svcname where the service is known to be
childless */ process.parent.args :
("WdiSystemHost","LicenseManager",
"StorSvc","CDPSvc","cdbhsvc","BthAvctpSvc","SstpSvc","WdiServiceHost",
"imgsvc","TrkWks","WpnService","IKEEXT","PolicyAgent","CryptSvc",
"netprofm","ProfSvc","StateRepository","camsvc","LanmanWorkstation",
"NlaSvc","EventLog","hidserv","DisplayEnhancementService","ShellHWDete
ction", "AppHostSvc","fhsvc","CscService","PushToInstall") and
/* unknown FPs can be added here */ not process.name :
("WerFault.exe","WerFaultSecure.exe","wermgr.exe")
----------------------------------

Version 4 (8.2.0 release)::
* Formatting only

Version 3 (7.12.0 release)::
* Formatting only

Version 2 (7.11.2 release)::
* Formatting only

