[[unusual-process-network-connection]]
=== Unusual Process Network Connection

Identifies network activity from unexpected system applications. This may indicate adversarial activity as these applications are often leveraged by adversaries to execute code and evade detection.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: low

*Risk score*: 21

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Defense Evasion
* has_guide

*Version*: 101 (<<unusual-process-network-connection-history, version history>>)

*Added ({stack} release)*: 7.6.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------
## Triage and analysis

### Investigating Unusual Process Network Connection

This rule identifies network activity from unexpected system utilities and applications. These applications are commonly
abused by attackers to execute code, evade detections, and bypass security protections.

#### Possible investigation steps

- Investigate the process execution chain (parent process tree) for unknown processes. Examine their executable files
for prevalence, whether they are located in expected locations, and if they are signed with valid digital signatures.
- Investigate other alerts associated with the user/host during the past 48 hours.
- Investigate the target host that the process is communicating with.
- Assess whether this behavior is prevalent in the environment by looking for similar occurrences across hosts.

### False positive analysis

- This activity is unlikely to happen legitimately. Benign true positives (B-TPs) can be added as exceptions if necessary.

### Response and remediation

- Initiate the incident response process based on the outcome of the triage.
- Isolate the involved hosts to prevent further post-compromise behavior.
- Investigate credential exposure on systems compromised or used by the attacker to ensure all compromised accounts are
identified. Reset passwords for these accounts and other potentially compromised credentials, such as email, business
systems, and web services.
- Run a full scan using the antimalware tool in place. This scan can reveal additional artifacts left in the system,
persistence mechanisms, and malware components.
- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.
- Review the privileges assigned to the user to ensure that the least privilege principle is being followed.
- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the
mean time to respond (MTTR).

----------------------------------


==== Rule query


[source,js]
----------------------------------
sequence by process.entity_id [process where (process.name :
"Microsoft.Workflow.Compiler.exe" or process.name :
"bginfo.exe" or process.name : "cdb.exe" or
process.name : "cmstp.exe" or process.name :
"csi.exe" or process.name : "dnx.exe" or
process.name : "fsi.exe" or process.name :
"ieexec.exe" or process.name : "iexpress.exe" or
process.name : "odbcconf.exe" or process.name :
"rcsi.exe" or process.name : "xwizard.exe") and
event.type == "start"] [network where (process.name :
"Microsoft.Workflow.Compiler.exe" or process.name :
"bginfo.exe" or process.name : "cdb.exe" or
process.name : "cmstp.exe" or process.name :
"csi.exe" or process.name : "dnx.exe" or
process.name : "fsi.exe" or process.name :
"ieexec.exe" or process.name : "iexpress.exe" or
process.name : "odbcconf.exe" or process.name :
"rcsi.exe" or process.name : "xwizard.exe")]
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Defense Evasion
** ID: TA0005
** Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
** Name: Trusted Developer Utilities Proxy Execution
** ID: T1127
** Reference URL: https://attack.mitre.org/techniques/T1127/

[[unusual-process-network-connection-history]]
==== Rule version history

Version 101 (8.5.0 release)::
* Formatting only

Version 9 (8.4.0 release)::
* Formatting only

Version 7 (7.12.0 release)::
* Formatting only

Version 6 (7.11.0 release)::
* Formatting only

Version 5 (7.10.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:network and event.type:connection and
process.name:(Microsoft.Workflow.Compiler.exe or bginfo.exe or cdb.exe
or cmstp.exe or csi.exe or dnx.exe or fsi.exe or ieexec.exe or
iexpress.exe or odbcconf.exe or rcsi.exe or xwizard.exe)
----------------------------------

Version 4 (7.9.1 release)::
* Formatting only

Version 3 (7.9.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.action:"Network connection detected (rule: NetworkConnect)" and
process.name:(Microsoft.Workflow.Compiler.exe or bginfo.exe or cdb.exe
or cmstp.exe or csi.exe or dnx.exe or fsi.exe or ieexec.exe or
iexpress.exe or odbcconf.exe or rcsi.exe or xwizard.exe)
----------------------------------

Version 2 (7.7.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.action:"Network connection detected (rule: NetworkConnect)" and
process.name:(bginfo.exe or cdb.exe or cmstp.exe or csi.exe or dnx.exe
or fsi.exe or ieexec.exe or iexpress.exe or
Microsoft.Workflow.Compiler.exe or odbcconf.exe or rcsi.exe or
xwizard.exe)
----------------------------------

