[[unusual-parent-process-for-cmd.exe]]
=== Unusual Parent Process for cmd.exe

Identifies a suspicious parent child process relationship with cmd.exe descending from an unusual process.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Execution

*Version*: 101 (<<unusual-parent-process-for-cmd.exe-history, version history>>)

*Added ({stack} release)*: 7.10.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------

----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.name : "cmd.exe" and
process.parent.name : ("lsass.exe",
"csrss.exe", "epad.exe",
"regsvr32.exe", "dllhost.exe",
"LogonUI.exe", "wermgr.exe",
"spoolsv.exe", "jucheck.exe",
"jusched.exe", "ctfmon.exe",
"taskhostw.exe", "GoogleUpdate.exe",
"sppsvc.exe", "sihost.exe",
"slui.exe", "SIHClient.exe",
"SearchIndexer.exe",
"SearchProtocolHost.exe",
"FlashPlayerUpdateService.exe",
"WerFault.exe", "WUDFHost.exe",
"unsecapp.exe", "wlanext.exe" )
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Execution
** ID: TA0002
** Reference URL: https://attack.mitre.org/tactics/TA0002/
* Technique:
** Name: Command and Scripting Interpreter
** ID: T1059
** Reference URL: https://attack.mitre.org/techniques/T1059/

[[unusual-parent-process-for-cmd.exe-history]]
==== Rule version history

Version 101 (8.5.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
process.name : "cmd.exe" and process.parent.name : ("lsass.exe",
"csrss.exe", "epad.exe",
"regsvr32.exe", "dllhost.exe",
"LogonUI.exe", "wermgr.exe",
"spoolsv.exe", "jucheck.exe",
"jusched.exe", "ctfmon.exe",
"taskhostw.exe", "GoogleUpdate.exe",
"sppsvc.exe", "sihost.exe",
"slui.exe", "SIHClient.exe",
"SearchIndexer.exe",
"SearchProtocolHost.exe",
"FlashPlayerUpdateService.exe",
"WerFault.exe", "WUDFHost.exe",
"unsecapp.exe", "wlanext.exe" )
----------------------------------

Version 7 (8.4.0 release)::
* Formatting only

Version 5 (8.2.0 release)::
* Formatting only

Version 4 (7.13.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:process and event.type:(start or process_started) and
process.name:cmd.exe and process.parent.name:(lsass.exe or csrss.exe
or notepad.exe or regsvr32.exe or dllhost.exe or LogonUI.exe or
wermgr.exe or spoolsv.exe or jucheck.exe or jusched.exe or ctfmon.exe
or taskhostw.exe or GoogleUpdate.exe or sppsvc.exe or sihost.exe or
slui.exe or SIHClient.exe or SearchIndexer.exe or
SearchProtocolHost.exe or FlashPlayerUpdateService.exe or WerFault.exe
or WUDFHost.exe or unsecapp.exe or wlanext.exe)
----------------------------------

Version 3 (7.12.0 release)::
* Formatting only

Version 2 (7.11.2 release)::
* Formatting only

