[[unusual-parent-child-relationship]]
=== Unusual Parent-Child Relationship

Identifies Windows programs run from unexpected parent processes. This could indicate masquerading or other strange activity on a system.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://github.com/sbousseaden/Slides/blob/master/Hunting%20MindMaps/PNG/Windows%20Processes%20TH.map.png
* https://www.andreafortuna.org/2017/06/15/standard-windows-processes-a-brief-reference/

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Privilege Escalation

*Version*: 101 (<<unusual-parent-child-relationship-history, version history>>)

*Added ({stack} release)*: 7.6.0

*Last modified ({stack} release)*: 8.5.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Investigation guide


[source,markdown]
----------------------------------
## Triage and analysis

### Investigating Unusual Parent-Child Relationship

Windows internal/system processes have some characteristics that can be used to spot suspicious activities. One of these
characteristics is parent-child relationships. These relationships can be used to baseline the typical behavior of the
system and then alert on occurrences that don't comply with the baseline.

This rule uses this information to spot suspicious parent and child processes.

#### Possible investigation steps

- Investigate the process execution chain (parent process tree) for unknown processes. Examine their executable files
for prevalence, whether they are located in expected locations, and if they are signed with valid digital signatures.
- Investigate other alerts associated with the user/host during the past 48 hours.
- Investigate abnormal behaviors observed by the subject process such as network connections, registry or file
modifications, and any spawned child processes.
- Retrieve the process executable and determine if it is malicious:
  - Use a private sandboxed malware analysis system to perform analysis.
    - Observe and collect information about the following activities:
      - Attempts to contact external domains and addresses.
      - File and registry access, modification, and creation activities.
      - Service creation and launch activities.
      - Scheduled tasks creation.
  - Use the PowerShell Get-FileHash cmdlet to get the files' SHA-256 hash values.
    - Search for the existence and reputation of the hashes in resources like VirusTotal, Hybrid-Analysis, CISCO Talos, Any.run, etc.

### False positive analysis

- This activity is unlikely to happen legitimately. Benign true positives (B-TPs) can be added as exceptions if necessary.

### Response and remediation

- Initiate the incident response process based on the outcome of the triage.
- Isolate the involved host to prevent further post-compromise behavior.
- If the triage identified malware, search the environment for additional compromised hosts.
  - Implement temporary network rules, procedures, and segmentation to contain the malware.
  - Stop suspicious processes.
  - Immediately block the identified indicators of compromise (IoCs).
  - Inspect the affected systems for additional malware backdoors like reverse shells, reverse proxies, or droppers that
  attackers could use to reinfect the system.
- Remove and block malicious artifacts identified during triage.
- Run a full antimalware scan. This may reveal additional artifacts left in the system, persistence mechanisms, and
malware components.
- Determine the initial vector abused by the attacker and take action to prevent reinfection through the same vector.
- Using the incident response data, update logging and audit policies to improve the mean time to detect (MTTD) and the
mean time to respond (MTTR).
----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.parent.name != null
and ( /* suspicious parent processes */
(process.name:"autochk.exe" and not process.parent.name:"smss.exe") or
(process.name:("fontdrvhost.exe", "dwm.exe") and not
process.parent.name:("wininit.exe", "winlogon.exe")) or
(process.name:("consent.exe", "RuntimeBroker.exe", "TiWorker.exe") and
not process.parent.name:"svchost.exe") or
(process.name:"SearchIndexer.exe" and not
process.parent.name:"services.exe") or
(process.name:"SearchProtocolHost.exe" and not
process.parent.name:("SearchIndexer.exe", "dllhost.exe")) or
(process.name:"dllhost.exe" and not
process.parent.name:("services.exe", "svchost.exe")) or
(process.name:"smss.exe" and not process.parent.name:("System",
"smss.exe")) or (process.name:"csrss.exe" and not
process.parent.name:("smss.exe", "svchost.exe")) or
(process.name:"wininit.exe" and not process.parent.name:"smss.exe") or
(process.name:"winlogon.exe" and not process.parent.name:"smss.exe")
or (process.name:("lsass.exe", "LsaIso.exe") and not
process.parent.name:"wininit.exe") or (process.name:"LogonUI.exe"
and not process.parent.name:("wininit.exe", "winlogon.exe")) or
(process.name:"services.exe" and not
process.parent.name:"wininit.exe") or (process.name:"svchost.exe"
and not process.parent.name:("MsMpEng.exe", "services.exe")) or
(process.name:"spoolsv.exe" and not
process.parent.name:"services.exe") or (process.name:"taskhost.exe"
and not process.parent.name:("services.exe", "svchost.exe")) or
(process.name:"taskhostw.exe" and not
process.parent.name:("services.exe", "svchost.exe")) or
(process.name:"userinit.exe" and not process.parent.name:("dwm.exe",
"winlogon.exe")) or (process.name:("wmiprvse.exe",
"wsmprovhost.exe", "winrshost.exe") and not
process.parent.name:"svchost.exe") or /* suspicious child processes
*/ (process.parent.name:("SearchProtocolHost.exe", "taskhost.exe",
"csrss.exe") and not process.name:("werfault.exe", "wermgr.exe",
"WerFaultSecure.exe")) or (process.parent.name:"autochk.exe" and
not process.name:("chkdsk.exe", "doskey.exe", "WerFault.exe")) or
(process.parent.name:"smss.exe" and not process.name:("autochk.exe",
"smss.exe", "csrss.exe", "wininit.exe", "winlogon.exe", "setupcl.exe",
"WerFault.exe")) or (process.parent.name:"wermgr.exe" and not
process.name:("WerFaultSecure.exe", "wermgr.exe", "WerFault.exe")) or
(process.parent.name:"conhost.exe" and not
process.name:("mscorsvw.exe", "wermgr.exe", "WerFault.exe",
"WerFaultSecure.exe")) )
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Privilege Escalation
** ID: TA0004
** Reference URL: https://attack.mitre.org/tactics/TA0004/
* Technique:
** Name: Process Injection
** ID: T1055
** Reference URL: https://attack.mitre.org/techniques/T1055/

[[unusual-parent-child-relationship-history]]
==== Rule version history

Version 101 (8.5.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type in ("start", "process_started") and
process.parent.name != null and ( /* suspicious parent processes
*/ (process.name:"autochk.exe" and not
process.parent.name:"smss.exe") or
(process.name:("fontdrvhost.exe", "dwm.exe") and not
process.parent.name:("wininit.exe", "winlogon.exe")) or
(process.name:("consent.exe", "RuntimeBroker.exe", "TiWorker.exe") and
not process.parent.name:"svchost.exe") or
(process.name:"SearchIndexer.exe" and not
process.parent.name:"services.exe") or
(process.name:"SearchProtocolHost.exe" and not
process.parent.name:("SearchIndexer.exe", "dllhost.exe")) or
(process.name:"dllhost.exe" and not
process.parent.name:("services.exe", "svchost.exe")) or
(process.name:"smss.exe" and not process.parent.name:("System",
"smss.exe")) or (process.name:"csrss.exe" and not
process.parent.name:("smss.exe", "svchost.exe")) or
(process.name:"wininit.exe" and not process.parent.name:"smss.exe") or
(process.name:"winlogon.exe" and not process.parent.name:"smss.exe")
or (process.name:("lsass.exe", "LsaIso.exe") and not
process.parent.name:"wininit.exe") or (process.name:"LogonUI.exe"
and not process.parent.name:("wininit.exe", "winlogon.exe")) or
(process.name:"services.exe" and not
process.parent.name:"wininit.exe") or (process.name:"svchost.exe"
and not process.parent.name:("MsMpEng.exe", "services.exe")) or
(process.name:"spoolsv.exe" and not
process.parent.name:"services.exe") or (process.name:"taskhost.exe"
and not process.parent.name:("services.exe", "svchost.exe")) or
(process.name:"taskhostw.exe" and not
process.parent.name:("services.exe", "svchost.exe")) or
(process.name:"userinit.exe" and not process.parent.name:("dwm.exe",
"winlogon.exe")) or (process.name:("wmiprvse.exe",
"wsmprovhost.exe", "winrshost.exe") and not
process.parent.name:"svchost.exe") or /* suspicious child processes
*/ (process.parent.name:("SearchProtocolHost.exe", "taskhost.exe",
"csrss.exe") and not process.name:("werfault.exe", "wermgr.exe",
"WerFaultSecure.exe")) or (process.parent.name:"autochk.exe" and
not process.name:("chkdsk.exe", "doskey.exe", "WerFault.exe")) or
(process.parent.name:"smss.exe" and not process.name:("autochk.exe",
"smss.exe", "csrss.exe", "wininit.exe", "winlogon.exe", "setupcl.exe",
"WerFault.exe")) or (process.parent.name:"wermgr.exe" and not
process.name:("WerFaultSecure.exe", "wermgr.exe", "WerFault.exe")) or
(process.parent.name:"conhost.exe" and not
process.name:("mscorsvw.exe", "wermgr.exe", "WerFault.exe",
"WerFaultSecure.exe")) )
----------------------------------

Version 13 (8.4.0 release)::
* Formatting only

Version 11 (8.2.0 release)::
* Formatting only

Version 10 (7.16.0 release)::
* Formatting only

Version 9 (7.15.0 release)::
* Formatting only

Version 8 (7.12.0 release)::
* Formatting only

Version 7 (7.11.2 release)::
* Formatting only

Version 6 (7.11.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:process and event.type:(start or process_started) and
process.parent.executable:* and (process.parent.name:autochk.exe and
not process.name:(chkdsk.exe or doskey.exe or WerFault.exe) or
process.parent.name:smss.exe and not process.name:(autochk.exe or
smss.exe or csrss.exe or wininit.exe or winlogon.exe or WerFault.exe)
or process.name:autochk.exe and not process.parent.name:smss.exe or
process.name:(fontdrvhost.exe or dwm.exe) and not
process.parent.name:(wininit.exe or winlogon.exe) or
process.name:(consent.exe or RuntimeBroker.exe or TiWorker.exe) and
not process.parent.name:svchost.exe or process.name:wermgr.exe and not
process.parent.name:(svchost.exe or TiWorker.exe) or
process.name:SearchIndexer.exe and not
process.parent.name:services.exe or
process.name:SearchProtocolHost.exe and not
process.parent.name:(SearchIndexer.exe or dllhost.exe) or
process.name:dllhost.exe and not process.parent.name:(services.exe or
svchost.exe) or process.name:smss.exe and not
process.parent.name:(System or smss.exe) or process.name:csrss.exe and
not process.parent.name:(smss.exe or svchost.exe) or
process.name:wininit.exe and not process.parent.name:smss.exe or
process.name:winlogon.exe and not process.parent.name:smss.exe or
process.name:(lsass.exe or LsaIso.exe) and not
process.parent.name:wininit.exe or process.name:LogonUI.exe and not
process.parent.name:(wininit.exe or winlogon.exe) or
process.name:services.exe and not process.parent.name:wininit.exe or
process.name:svchost.exe and not process.parent.name:(MsMpEng.exe or
services.exe) or process.name:spoolsv.exe and not
process.parent.name:services.exe or process.name:taskhost.exe and not
process.parent.name:(services.exe or svchost.exe) or
process.name:taskhostw.exe and not process.parent.name:(services.exe
or svchost.exe) or process.name:userinit.exe and not
process.parent.name:(dwm.exe or winlogon.exe))
----------------------------------

Version 5 (7.10.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:process and event.type:(start or process_started) and
process.parent.executable:* and (process.name:smss.exe and not
process.parent.name:(System or smss.exe) or process.name:csrss.exe and
not process.parent.name:(smss.exe or svchost.exe) or
process.name:wininit.exe and not process.parent.name:smss.exe or
process.name:winlogon.exe and not process.parent.name:smss.exe or
process.name:lsass.exe and not process.parent.name:wininit.exe or
process.name:LogonUI.exe and not process.parent.name:(wininit.exe or
winlogon.exe) or process.name:services.exe and not
process.parent.name:wininit.exe or process.name:svchost.exe and not
process.parent.name:(MsMpEng.exe or services.exe) or
process.name:spoolsv.exe and not process.parent.name:services.exe or
process.name:taskhost.exe and not process.parent.name:(services.exe or
svchost.exe) or process.name:taskhostw.exe and not
process.parent.name:(services.exe or svchost.exe) or
process.name:userinit.exe and not process.parent.name:(dwm.exe or
winlogon.exe))
----------------------------------

Version 4 (7.9.1 release)::
* Formatting only

Version 3 (7.9.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.action:"Process Create (rule: ProcessCreate)" and
process.parent.executable:* and (process.name:smss.exe and not
process.parent.name:(System or smss.exe) or process.name:csrss.exe and
not process.parent.name:(smss.exe or svchost.exe) or
process.name:wininit.exe and not process.parent.name:smss.exe or
process.name:winlogon.exe and not process.parent.name:smss.exe or
process.name:lsass.exe and not process.parent.name:wininit.exe or
process.name:LogonUI.exe and not process.parent.name:(wininit.exe or
winlogon.exe) or process.name:services.exe and not
process.parent.name:wininit.exe or process.name:svchost.exe and not
process.parent.name:(MsMpEng.exe or services.exe) or
process.name:spoolsv.exe and not process.parent.name:services.exe or
process.name:taskhost.exe and not process.parent.name:(services.exe or
svchost.exe) or process.name:taskhostw.exe and not
process.parent.name:(services.exe or svchost.exe) or
process.name:userinit.exe and not process.parent.name:(dwm.exe or
winlogon.exe))
----------------------------------

Version 2 (7.7.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.action:"Process Create (rule: ProcessCreate)" and
process.parent.executable:* and ( (process.name:"smss.exe" and not
process.parent.name:("System" or "smss.exe")) or
(process.name:"csrss.exe" and not process.parent.name:("smss.exe" or
"svchost.exe")) or (process.name:"wininit.exe" and not
process.parent.name:"smss.exe") or (process.name:"winlogon.exe" and
not process.parent.name:"smss.exe") or (process.name:"lsass.exe" and
not process.parent.name:"wininit.exe") or (process.name:"LogonUI.exe"
and not process.parent.name:("winlogon.exe" or "wininit.exe")) or
(process.name:"services.exe" and not
process.parent.name:"wininit.exe") or (process.name:"svchost.exe" and
not process.parent.name:("services.exe" or "MsMpEng.exe")) or
(process.name:"spoolsv.exe" and not
process.parent.name:"services.exe") or (process.name:"taskhost.exe"
and not process.parent.name:("services.exe" or "svchost.exe")) or
(process.name:"taskhostw.exe" and not
process.parent.name:("services.exe" or "svchost.exe")) or
(process.name:"userinit.exe" and not process.parent.name:("dwm.exe" or
"winlogon.exe")) )
----------------------------------

