[[user-added-to-privileged-group-in-active-directory]]
=== User Added to Privileged Group in Active Directory

Identifies a user being added to a privileged group in Active Directory. Privileged accounts and groups in Active Directory are those to which powerful rights, privileges, and permissions are granted that allow them to perform nearly any action in Active Directory and on domain-joined systems.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-windows.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/plan/security-best-practices/appendix-b--privileged-accounts-and-groups-in-active-directory

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Persistence

*Version*: 3 (<<user-added-to-privileged-group-in-active-directory-history, version history>>)

*Added ({stack} release)*: 7.12.0

*Last modified ({stack} release)*: 7.16.0

*Rule authors*: Elastic, Skoetting

*Rule license*: Elastic License v2

==== Rule query


[source,js]
----------------------------------
iam where event.action == "added-member-to-group" and group.name :
("Admin*", "Local Administrators",
"Domain Admins", "Enterprise Admins",
"Backup Admins", "Schema Admins",
"DnsAdmins", "Exchange Organization Administrators")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Persistence
** ID: TA0003
** Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
** Name: Account Manipulation
** ID: T1098
** Reference URL: https://attack.mitre.org/techniques/T1098/

[[user-added-to-privileged-group-in-active-directory-history]]
==== Rule version history

Version 3 (7.16.0 release)::
* Formatting only

Version 2 (7.13.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
event.category:iam and event.action:"added-member-to-group" and
group.name:(Administrators or "Local Administrators" or "Domain
Admins" or "Enterprise Admins" or "Backup Admins" or "Schema Admins"
or "DnsAdmins")
----------------------------------

