[[webshell-detection-script-process-child-of-common-web-processes]]
=== Webshell Detection: Script Process Child of Common Web Processes

Identifies suspicious commands executed via a web server, which may suggest a vulnerability and remote shell access.

*Rule type*: eql

*Rule indices*:

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*

*Severity*: high

*Risk score*: 73

*Runs every*: 5 minutes

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*:

* https://www.microsoft.com/security/blog/2020/02/04/ghost-in-the-shell-investigating-web-shell-attacks/

*Tags*:

* Elastic
* Host
* Windows
* Threat Detection
* Persistence

*Version*: 6 (<<webshell-detection-script-process-child-of-common-web-processes-history, version history>>)

*Added ({stack} release)*: 7.15.0

*Last modified ({stack} release)*: 8.4.0

*Rule authors*: Elastic

*Rule license*: Elastic License v2

==== Potential false positives

Security audits, maintenance, and network administrative scripts may trigger this alert when run under web processes.

==== Investigation guide


[source,markdown]
----------------------------------
## Triage and analysis

Detections should be investigated to identify if the activity corresponds to legitimate activity. As this rule detects post-exploitation process activity, investigations into this should be prioritized.
----------------------------------


==== Rule query


[source,js]
----------------------------------
process where event.type == "start" and process.parent.name :
("w3wp.exe", "httpd.exe", "nginx.exe", "php.exe", "php-cgi.exe",
"tomcat.exe") and process.name : ("cmd.exe", "cscript.exe",
"powershell.exe", "pwsh.exe", "powershell_ise.exe", "wmic.exe",
"wscript.exe")
----------------------------------

==== Threat mapping

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Persistence
** ID: TA0003
** Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
** Name: Server Software Component
** ID: T1505
** Reference URL: https://attack.mitre.org/techniques/T1505/


* Tactic:
** Name: Initial Access
** ID: TA0001
** Reference URL: https://attack.mitre.org/tactics/TA0001/
* Technique:
** Name: Exploit Public-Facing Application
** ID: T1190
** Reference URL: https://attack.mitre.org/techniques/T1190/

[[webshell-detection-script-process-child-of-common-web-processes-history]]
==== Rule version history

Version 6 (8.4.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type == "start" and process.parent.name :
("w3wp.exe", "httpd.exe", "nginx.exe", "php.exe", "php-cgi.exe",
"tomcat.exe") and process.name : ("cmd.exe", "cscript.exe",
"powershell.exe", "pwsh.exe", "powershell_ise.exe", "wmic.exe",
"wscript.exe")
----------------------------------

Version 4 (8.2.0 release)::
* Formatting only

Version 3 (7.16.0 release)::
* Updated query, changed from:
+
[source, js]
----------------------------------
process where event.type == "start" and process.parent.name :
("w3wp.exe", "httpd.exe", "nginx.exe", "php.exe", "php-cgi.exe",
"tomcat.exe") and process.name : ("cmd.exe", "cscript.exe",
"powershell.exe", "pwsh.exe", "wmic.exe", "wscript.exe")
----------------------------------

