[[prebuilt-rule-8-8-2-container-management-utility-run-inside-a-container]]
=== Container Management Utility Run Inside A Container

This rule detects when a container management binary is run from inside a container. These binaries are critical components of many containerized environments, and their presence and execution in unauthorized containers could indicate compromise or a misconfiguration.

*Rule type*: eql

*Rule indices*: 

* logs-cloud_defend*

*Severity*: low

*Risk score*: 21

*Runs every*: 5m

*Searches indices from*: now-6m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*: None

*Tags*: 

* Elastic
* Host
* Linux
* Threat Detection
* Execution
* Container

*Version*: 1

*Rule authors*: 

* Elastic

*Rule license*: Elastic Licence v2


==== Rule query


[source, js]
----------------------------------
process where container.id: "*" and event.type== "start" 
  and process.name: ("dockerd", "docker", "kubelet", "kube-proxy", "kubectl", "containerd", "runc", "systemd", "crictl")

----------------------------------

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Execution
** ID: TA0002
** Reference URL: https://attack.mitre.org/tactics/TA0002/
* Technique:
** Name: Container Administration Command
** ID: T1609
** Reference URL: https://attack.mitre.org/techniques/T1609/
