---
id: serverlessSecurityAttemptToDisableSyslogService
slug: /serverless/security/attempt-to-disable-syslog-service
title: Attempt to Disable Syslog Service
description: Description to be written
tags: []
---

<div id="attempt-to-disable-syslog-service"></div>

Adversaries may attempt to disable the syslog service in an attempt to an attempt to disrupt event logging and evade detection by security controls.

**Rule type**: eql

**Rule indices**: 

* auditbeat-*
* logs-endpoint.events.*
* endgame-*

**Severity**: medium

**Risk score**: 47

**Runs every**: 5m

**Searches indices from**: now-9m ([Date Math format](((ref))/common-options.html#date-math), see also <DocLink id="serverlessSecurityRulesUiCreate" section="set-the-rules-schedule">`Additional look-back time`</DocLink>)

**Maximum alerts per execution**: 100

**References**: None

**Tags**: 

* Domain: Endpoint
* OS: Linux
* Use Case: Threat Detection
* Tactic: Defense Evasion
* Data Source: Elastic Endgame

**Version**: 105

**Rule authors**: 

* Elastic

**Rule license**: Elastic License v2

## Rule query

```js
process where host.os.type == "linux" and event.action in ("exec", "exec_event") and
 ( (process.name == "service" and process.args == "stop") or
   (process.name == "chkconfig" and process.args == "off") or
   (process.name == "systemctl" and process.args in ("disable", "stop", "kill"))
 ) and process.args in ("syslog", "rsyslog", "syslog-ng")

```

**Framework**: MITRE ATT&CK<sup>TM</sup>

* Tactic:
    * Name: Defense Evasion
    * ID: TA0005
    * Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
    * Name: Impair Defenses
    * ID: T1562
    * Reference URL: https://attack.mitre.org/techniques/T1562/
* Sub-technique:
    * Name: Disable or Modify Tools
    * ID: T1562.001
    * Reference URL: https://attack.mitre.org/techniques/T1562/001/

