---
id: serverlessSecurityDownloadedUrlFiles
slug: /serverless/security/downloaded-url-files
title: Downloaded URL Files
description: Description to be written
tags: []
---

<div id="downloaded-url-files"></div>

Identifies .url shortcut files downloaded from outside the local network. These shortcut files are commonly used in phishing campaigns.

**Rule type**: eql

**Rule indices**: 

* logs-endpoint.events.*
* winlogbeat-*
* logs-windows.*

**Severity**: medium

**Risk score**: 47

**Runs every**: 5m

**Searches indices from**: now-9m ([Date Math format](((ref))/common-options.html#date-math), see also <DocLink id="serverlessSecurityRulesUiCreate" section="set-the-rules-schedule">`Additional look-back time`</DocLink>)

**Maximum alerts per execution**: 100

**References**: None

**Tags**: 

* Domain: Endpoint
* OS: Windows
* Use Case: Threat Detection
* Tactic: Execution

**Version**: 1

**Rule authors**: 

* Elastic

**Rule license**: Elastic License v2

## Rule query

```js
/* leaving in development pending `file.Ext.windows.zone_identifier` landing in ECS then endpoint */

sequence by process.entity_id with maxspan=2s
  [file where host.os.type == "windows" and event.type == "creation" and file.extension == "url" and
     not process.name == "explorer.exe"]
  [file where host.os.type == "windows" and event.type == "creation" and file.extension == "url:Zone.Identifier" and
      /* non-ECS field - may disqualify conversion */
     file.Ext.windows.zone_identifier > 1 and not process.name == "explorer.exe"]

```

**Framework**: MITRE ATT&CK<sup>TM</sup>

* Tactic:
    * Name: Execution
    * ID: TA0002
    * Reference URL: https://attack.mitre.org/tactics/TA0002/
* Technique:
    * Name: User Execution
    * ID: T1204
    * Reference URL: https://attack.mitre.org/techniques/T1204/
* Tactic:
    * Name: Initial Access
    * ID: TA0001
    * Reference URL: https://attack.mitre.org/tactics/TA0001/
* Technique:
    * Name: Phishing
    * ID: T1566
    * Reference URL: https://attack.mitre.org/techniques/T1566/
* Sub-technique:
    * Name: Spearphishing Attachment
    * ID: T1566.001
    * Reference URL: https://attack.mitre.org/techniques/T1566/001/
* Sub-technique:
    * Name: Spearphishing Link
    * ID: T1566.002
    * Reference URL: https://attack.mitre.org/techniques/T1566/002/

