---
id: serverlessSecurityEsxiDiscoveryViaGrep
slug: /en/security/esxi-discovery-via-grep
title: ESXI Discovery via Grep
description: Description to be written
tags: []
---

<div id="esxi-discovery-via-grep"></div>

Identifies instances where a process named 'grep', 'egrep', or 'pgrep' is started on a Linux system with arguments related to virtual machine (VM) files, such as "vmdk", "vmx", "vmxf", "vmsd", "vmsn", "vswp", "vmss", "nvram", or "vmem". These file extensions are associated with VM-related file formats, and their presence in grep command arguments may indicate that a threat actor is attempting to search for, analyze, or manipulate VM files on the system.

**Rule type**: eql

**Rule indices**: 

* logs-endpoint.events.*

**Severity**: medium

**Risk score**: 47

**Runs every**: 5m

**Searches indices from**: now-9m ([Date Math format](((ref))/common-options.html#date-math), see also <DocLink id="serverlessSecurityRulesUiCreate" section="set-the-rules-schedule">`Additional look-back time`</DocLink>)

**Maximum alerts per execution**: 100

**References**: 

* https://www.bleepingcomputer.com/news/security/massive-esxiargs-ransomware-attack-targets-vmware-esxi-servers-worldwide/

**Tags**: 

* Domain: Endpoint
* OS: Linux
* Use Case: Threat Detection
* Tactic: Discovery

**Version**: 2

**Rule authors**: 

* Elastic

**Rule license**: Elastic License v2

## Rule query

```js
process where host.os.type == "linux" and event.type == "start" and event.action == "exec" and
process.name : ("grep", "egrep", "pgrep") and
process.args : ("vmdk", "vmx", "vmxf", "vmsd", "vmsn", "vswp", "vmss", "nvram", "vmem")

```

**Framework**: MITRE ATT&CK<sup>TM</sup>

* Tactic:
    * Name: Discovery
    * ID: TA0007
    * Reference URL: https://attack.mitre.org/tactics/TA0007/
* Technique:
    * Name: Software Discovery
    * ID: T1518
    * Reference URL: https://attack.mitre.org/techniques/T1518/

