---
id: serverlessSecurityLsassProcessAccessViaWindowsApi
slug: /en/security/lsass-process-access-via-windows-api
title: LSASS Process Access via Windows API
description: Description to be written
tags: []
---

<div id="lsass-process-access-via-windows-api"></div>

Identifies access attempts to the LSASS handle, which may indicate an attempt to dump credentials from LSASS memory.

**Rule type**: eql

**Rule indices**: 

* logs-endpoint.events.*

**Severity**: medium

**Risk score**: 47

**Runs every**: 5m

**Searches indices from**: now-9m ([Date Math format](((ref))/common-options.html#date-math), see also <DocLink id="serverlessSecurityRulesUiCreate" section="set-the-rules-schedule">`Additional look-back time`</DocLink>)

**Maximum alerts per execution**: 100

**References**: 

* https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.001/T1003.001.md

**Tags**: 

* Domain: Endpoint
* OS: Windows
* Use Case: Threat Detection
* Tactic: Credential Access

**Version**: 2

**Rule authors**: 

* Elastic

**Rule license**: Elastic License v2

## Rule query

```js
api where host.os.type == "windows" and 
 process.Ext.api.name in ("OpenProcess", "OpenThread") and Target.process.name : "lsass.exe"

```

**Framework**: MITRE ATT&CK<sup>TM</sup>

* Tactic:
    * Name: Credential Access
    * ID: TA0006
    * Reference URL: https://attack.mitre.org/tactics/TA0006/
* Technique:
    * Name: OS Credential Dumping
    * ID: T1003
    * Reference URL: https://attack.mitre.org/techniques/T1003/
* Sub-technique:
    * Name: LSASS Memory
    * ID: T1003.001
    * Reference URL: https://attack.mitre.org/techniques/T1003/001/

