---
id: serverlessSecurityPersistenceViaTelemetrycontrollerScheduledTaskHijack
slug: /en/security/persistence-via-telemetrycontroller-scheduled-task-hijack
title: Persistence via TelemetryController Scheduled Task Hijack
description: Description to be written
tags: []
---

<div id="persistence-via-telemetrycontroller-scheduled-task-hijack"></div>

Detects the successful hijack of Microsoft Compatibility Appraiser scheduled task to establish persistence with an integrity level of system.

**Rule type**: eql

**Rule indices**: 

* winlogbeat-*
* logs-endpoint.events.*
* logs-windows.*
* endgame-*

**Severity**: high

**Risk score**: 73

**Runs every**: 5m

**Searches indices from**: now-9m ([Date Math format](((ref))/common-options.html#date-math), see also <DocLink id="serverlessSecurityRulesUiCreate" section="set-the-rules-schedule">`Additional look-back time`</DocLink>)

**Maximum alerts per execution**: 100

**References**: 

* https://www.trustedsec.com/blog/abusing-windows-telemetry-for-persistence

**Tags**: 

* Domain: Endpoint
* OS: Windows
* Use Case: Threat Detection
* Tactic: Persistence
* Data Source: Elastic Endgame

**Version**: 104

**Rule authors**: 

* Elastic

**Rule license**: Elastic License v2

## Investigation guide

```markdown

```

## Rule query

```js
process where host.os.type == "windows" and event.type == "start" and
  process.parent.name : "CompatTelRunner.exe" and process.args : "-cv*" and
  not process.name : ("conhost.exe",
                      "DeviceCensus.exe",
                      "CompatTelRunner.exe",
                      "DismHost.exe",
                      "rundll32.exe",
                      "powershell.exe")

```

**Framework**: MITRE ATT&CK<sup>TM</sup>

* Tactic:
    * Name: Persistence
    * ID: TA0003
    * Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
    * Name: Scheduled Task/Job
    * ID: T1053
    * Reference URL: https://attack.mitre.org/techniques/T1053/
* Sub-technique:
    * Name: Scheduled Task
    * ID: T1053.005
    * Reference URL: https://attack.mitre.org/techniques/T1053/005/

