---
id: serverlessSecurityPotentialPersistenceViaTimeProviderModification
slug: /serverless/security/potential-persistence-via-time-provider-modification
title: Potential Persistence via Time Provider Modification
description: Description to be written
tags: []
---

<div id="potential-persistence-via-time-provider-modification"></div>

Identifies modification of the Time Provider. Adversaries may establish persistence by registering and enabling a malicious DLL as a time provider. Windows uses the time provider architecture to obtain accurate time stamps from other network devices or clients in the network. Time providers are implemented in the form of a DLL file which resides in the System32 folder. The service W32Time initiates during the startup of Windows and loads w32time.dll.

**Rule type**: eql

**Rule indices**: 

* logs-endpoint.events.*
* endgame-*

**Severity**: medium

**Risk score**: 47

**Runs every**: 5m

**Searches indices from**: now-9m ([Date Math format](((ref))/common-options.html#date-math), see also <DocLink id="serverlessSecurityRulesUiCreate" section="set-the-rules-schedule">`Additional look-back time`</DocLink>)

**Maximum alerts per execution**: 100

**References**: 

* https://pentestlab.blog/2019/10/22/persistence-time-providers/

**Tags**: 

* Domain: Endpoint
* OS: Windows
* Use Case: Threat Detection
* Tactic: Persistence
* Data Source: Elastic Endgame

**Version**: 103

**Rule authors**: 

* Elastic

**Rule license**: Elastic License v2

## Rule query

```js
registry where host.os.type == "windows" and event.type:"change" and
  registry.path: (
    "HKLM\\SYSTEM\\*ControlSet*\\Services\\W32Time\\TimeProviders\\*",
    "\\REGISTRY\\MACHINE\\SYSTEM\\*ControlSet*\\Services\\W32Time\\TimeProviders\\*"
  ) and
  registry.data.strings:"*.dll"

```

**Framework**: MITRE ATT&CK<sup>TM</sup>

* Tactic:
    * Name: Persistence
    * ID: TA0003
    * Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
    * Name: Boot or Logon Autostart Execution
    * ID: T1547
    * Reference URL: https://attack.mitre.org/techniques/T1547/
* Sub-technique:
    * Name: Time Providers
    * ID: T1547.003
    * Reference URL: https://attack.mitre.org/techniques/T1547/003/

