---
id: serverlessSecurityPotentialPrivacyControlBypassViaTccdbModification
slug: /en/security/potential-privacy-control-bypass-via-tccdb-modification
title: Potential Privacy Control Bypass via TCCDB Modification
description: Description to be written
tags: []
---

<div id="potential-privacy-control-bypass-via-tccdb-modification"></div>

Identifies the use of sqlite3 to directly modify the Transparency, Consent, and Control (TCC) SQLite database. This may indicate an attempt to bypass macOS privacy controls, including access to sensitive resources like the system camera, microphone, address book, and calendar.

**Rule type**: eql

**Rule indices**: 

* auditbeat-*
* logs-endpoint.events.*

**Severity**: medium

**Risk score**: 47

**Runs every**: 5m

**Searches indices from**: now-9m ([Date Math format](((ref))/common-options.html#date-math), see also <DocLink id="serverlessSecurityRulesUiCreate" section="set-the-rules-schedule">`Additional look-back time`</DocLink>)

**Maximum alerts per execution**: 100

**References**: 

* https://applehelpwriter.com/2016/08/29/discovering-how-dropbox-hacks-your-mac/
* https://github.com/bp88/JSS-Scripts/blob/master/TCC.db%20Modifier.sh
* https://medium.com/@mattshockl/cve-2020-9934-bypassing-the-os-x-transparency-consent-and-control-tcc-framework-for-4e14806f1de8

**Tags**: 

* Domain: Endpoint
* OS: macOS
* Use Case: Threat Detection
* Tactic: Defense Evasion

**Version**: 103

**Rule authors**: 

* Elastic

**Rule license**: Elastic License v2

## Investigation guide

```markdown

```

## Rule query

```js
process where host.os.type == "macos" and event.type in ("start", "process_started") and process.name : "sqlite*" and
 process.args : "/*/Application Support/com.apple.TCC/TCC.db" and
 not process.parent.executable : "/Library/Bitdefender/AVP/product/bin/*"

```

**Framework**: MITRE ATT&CK<sup>TM</sup>

* Tactic:
    * Name: Defense Evasion
    * ID: TA0005
    * Reference URL: https://attack.mitre.org/tactics/TA0005/
* Technique:
    * Name: Impair Defenses
    * ID: T1562
    * Reference URL: https://attack.mitre.org/techniques/T1562/
* Sub-technique:
    * Name: Disable or Modify Tools
    * ID: T1562.001
    * Reference URL: https://attack.mitre.org/techniques/T1562/001/

