---
id: serverlessSecuritySuspiciousCrontabCreationOrModification
slug: /serverless/security/suspicious-crontab-creation-or-modification
title: Suspicious CronTab Creation or Modification
description: Description to be written
tags: []
---

<div id="suspicious-crontab-creation-or-modification"></div>

Identifies attempts to create or modify a crontab via a process that is not crontab (i.e python, osascript, etc.). This activity should not be highly prevalent and could indicate the use of cron as a persistence mechanism by a threat actor.

**Rule type**: eql

**Rule indices**: 

* logs-endpoint.events.*

**Severity**: medium

**Risk score**: 47

**Runs every**: 5m

**Searches indices from**: now-9m ([Date Math format](((ref))/common-options.html#date-math), see also <DocLink id="serverlessSecurityRulesUiCreate" section="set-the-rules-schedule">`Additional look-back time`</DocLink>)

**Maximum alerts per execution**: 100

**References**: 

* https://taomm.org/PDFs/vol1/CH%200x02%20Persistence.pdf
* https://theevilbit.github.io/beyond/beyond_0004/

**Tags**: 

* Domain: Endpoint
* OS: macOS
* Use Case: Threat Detection
* Tactic: Persistence

**Version**: 103

**Rule authors**: 

* Elastic

**Rule license**: Elastic License v2

## Rule query

```js
file where host.os.type == "macos" and event.type != "deletion" and process.name != null and
  file.path : "/private/var/at/tabs/*" and not process.executable == "/usr/bin/crontab"

```

**Framework**: MITRE ATT&CK<sup>TM</sup>

* Tactic:
    * Name: Persistence
    * ID: TA0003
    * Reference URL: https://attack.mitre.org/tactics/TA0003/
* Technique:
    * Name: Scheduled Task/Job
    * ID: T1053
    * Reference URL: https://attack.mitre.org/techniques/T1053/
* Sub-technique:
    * Name: Cron
    * ID: T1053.003
    * Reference URL: https://attack.mitre.org/techniques/T1053/003/

