[[prebuilt-rule-8-4-4-suspicious-inter-process-communication-via-outlook]]
=== Suspicious Inter-Process Communication via Outlook

Detects Inter-Process Communication with Outlook via Component Object Model from an unusual process. Adversaries may target user email to collect sensitive information or send email on their behalf via API.

*Rule type*: eql

*Rule indices*: 

* logs-endpoint.events.*

*Severity*: medium

*Risk score*: 47

*Runs every*: 5m

*Searches indices from*: now-9m ({ref}/common-options.html#date-math[Date Math format], see also <<rule-schedule, `Additional look-back time`>>)

*Maximum alerts per execution*: 100

*References*: 

* https://github.com/center-for-threat-informed-defense/adversary_emulation_library/blob/master/apt29/Archive/CALDERA_DIY/evals/payloads/stepSeventeen_email.ps1

*Tags*: 

* Elastic
* Host
* Windows
* Threat Detection
* Collection

*Version*: 2

*Rule authors*: 

* Elastic

*Rule license*: Elastic License v2


==== Rule query


[source, js]
----------------------------------
process where host.os.type == "windows" and event.action == "start" and process.name : "OUTLOOK.EXE"  and
 process.Ext.effective_parent.name != null and
 not process.Ext.effective_parent.executable : ("?:\\Program Files\\*", "?:\\Program Files (x86)\\*")

----------------------------------

*Framework*: MITRE ATT&CK^TM^

* Tactic:
** Name: Collection
** ID: TA0009
** Reference URL: https://attack.mitre.org/tactics/TA0009/
* Technique:
** Name: Email Collection
** ID: T1114
** Reference URL: https://attack.mitre.org/techniques/T1114/
* Sub-technique:
** Name: Local Email Collection
** ID: T1114.001
** Reference URL: https://attack.mitre.org/techniques/T1114/001/
* Tactic:
** Name: Execution
** ID: TA0002
** Reference URL: https://attack.mitre.org/tactics/TA0002/
* Technique:
** Name: Inter-Process Communication
** ID: T1559
** Reference URL: https://attack.mitre.org/techniques/T1559/
* Sub-technique:
** Name: Component Object Model
** ID: T1559.001
** Reference URL: https://attack.mitre.org/techniques/T1559/001/
